[
  "Use slash key (/) to focus search from anywhere",
  "Use arrow keys (↑ and ↓) to navigate suggestions, then Enter to go",
  "Use escape (Esc) to close search",
  "Enter an appid to be redirected to the app page",
  "Enter a steamid (7656…) to be redirected to calculator",
  "Any profile link containing id/ or profiles/",
  "Any text containing app/ or sub/ or bundle/ or depot/",
  "About",
  "Blog",
  "Discord",
  "Discord Bot",
  "FAQ & help",
  "Donate & contribute",
  "Browser extension",
  "Discovery",
  "Sales & Deals",
  "Upcoming releases",
  "Release calendar",
  "Free promotions",
  "Bundles",
  "Price changes",
  "When is next sale?",
  "Tools",
  "Charts",
  "Calculator",
  "Patch notes",
  "Search",
  "Instant search",
  "Steam Status",
  "Steam Web API",
  "Database",
  "Game tags",
  "Developers",
  "Publishers",
  "Profile badges",
  "Engines & technologies",
  "Game releases by year",
  "Change history",
  "Rankings",
  "Top rated games",
  "Global top sellers",
  "Weekly top sellers",
  "Most followed games",
  "Most wishlisted games",
  "Wishlist activity",
  "Daily active users",
  "Top game owners",
  "Top profile levels",
  "Account",
  "Sign in via Steam",
  "Free packages",
  "Socials",
  "Bluesky",
  "Mastodon",
  "X (Twitter)",
  "GitHub",
  "Steam group",
  "Steam curator",
  "Valve announces three new Steam Hardware devices: Steam Machine, Steam Frame, and Steam Controller",
  "A decade after the original failure, Valve tries again. A very in-depth summary of all press coverage and official announcements.",
  "Valve has announced three new hardware products expanding the Steam Hardware family, all scheduled to launch in early 2026. The announcement introduces the Steam Controller, Steam Machine, and Steam Frame, joining the existing Steam Deck in Valve's hardware lineup.",
  "According to Valve President Gabe Newell, the expansion comes in response to continued demand from PC gamers. \"We've been super happy with the success of Steam Deck, and PC gamers have continued asking for even more ways to play all the great titles in their Steam libraries,\" Newell stated. \"Our work over the years on other hardware and even more importantly on SteamOS has enabled Steam Controller, Steam Machine, and Steam Frame to do just that.\"",
  "Why Now?",
  "If this feels familiar, a very similar announcement happened almost exactly 10 years ago! So why now? According to Valve, the timing comes down to both hardware and software maturity. The company believes they have finally worked out both aspects after years of development.",
  "The success of SteamOS on Steam Deck proved crucial, with many users already docking their devices to TVs for a console-like experience. According to Valve, 10-15% of Steam Decks are connected to an external display at any given time, and these users specifically requested more \"crispness and graphics horsepower.\" Valve saw an opportunity to provide a better experience for that use case without the weight and battery life constraints of a portable device.",
  "The original Steam Machines launched in 2015 had two critical failures: Valve didn't actually ship them themselves, and instead worked with third-party manufacturers who created a confusing multitude of different machines. Additionally, SteamOS at the time was nowhere near its current maturity. Since then, Valve has invested heavily in Proton, an open-source project for running Windows games on Linux, which has dramatically improved game compatibility on SteamOS.",
  "Jump to: Steam Machine, Steam Frame, Steam Controller.",
  "Steam Machine",
  "Steam Machine (codename Fremont) is a compact gaming PC (GabeCube) designed for big-screen gaming, with proportions very close to the GameCube. The device was specifically designed to fit under a 15cm shelf in media units, with careful attention paid to leg height, down to fractions of a millimeter. The device runs SteamOS, providing the same user experience as Steam Deck, and is designed to work with Steam Controller while supporting other accessories as well. Games that are Steam Deck Verified will automatically be verified on Steam Machine.",
  "Performance",
  "The semi-custom AMD solution features a Zen 4 CPU with peak frequencies of 4.8 GHz boost and an RDNA3 GPU running at 2.45 GHz sustained clock with 110W TDP. Valve worked with AMD on custom firmware, software and fusing to optimize performance and power. The system is designed to support 4K gaming at 60 FPS with ray tracing enabled using FSR upscaling, targeting performance comparable to current generation consoles in a compact form factor. According to Valve's design mandate, the Steam Machine needed to have enough performance to play every game on Steam at 4K 60Hz when using upscaling.",
  "When determining the performance target, Valve used the Steam Hardware Survey as a key benchmark to understand where users' home devices currently stand. According to Valve, the Steam Machine will provide equal or better performance than 70% of users currently on Steam, making it an attractive upgrade path for those on older machines. In terms of GPU equivalency, the RDNA3 configuration is comparable to an AMD Radeon 7600M XT laptop GPU or an Nvidia RTX 4060 on the desktop side. Valve has demonstrated the system running demanding AAA titles including Cyberpunk 2077, Black Myth: Wukong, Hades II, and Silent Hill f.",
  "Cooling & Thermal Design",
  "Valve took an unusual approach by designing the fan first, recognizing that heat removal requirements dictate necessary airflow. The result is a 120mm axial fan running at 500-2,000 RPM with just 0.5-1mm blade-to-frame clearance. At idle and light tasks, the system runs in the mid-20s dB, reaching only 28-30 dB at full load.",
  "The cooling system features four approximately 8mm heat pipes and an aluminum fin stack that contacts the CPU with phase change thermal interface material and the GPU with paste. The fin stack doubles as RF shielding between the motherboard and antennas. The system maintains 95% flow performance versus unrestricted bottom intake even with the current leg height, and includes a plastic ridge on the bottom to block hot exhaust recirculation.",
  "Living rooms present challenging thermal environments where devices can be placed in corners or behind objects, so the system features 360-degree intake to ensure adequate cooling regardless of placement. Valve invested extensive computational fluid dynamics analysis into the design.",
  "The 120mm cooling fan is a Delta unit slightly thicker than the standard 25mm for extra static pressure, and it includes integrated antenna mounts and IO mounts. The 300W internal power supply is integrated to the point where it's actually part of the chassis, with the cooling system pulling air directly through it, eliminating any need for the power supply to have its own fan.",
  "Custom Motherboard & Power",
  "The motherboard is a custom 10-layer PCB required for GDDR6 routing, using back drilling techniques to remove via stubs that could cause signal reflections. All I/O is routed through the CPU without a separate AMD chipset. The custom board enables HDMI CEC support, allowing the system to automatically turn on TVs and soundbars, configure inputs, and wake with a single button press. Valve tested this functionality against a wide variety of home entertainment equipment. This functionality specifically required Valve to build a custom motherboard, which means it wouldn't work on DIY builds without serious cooperation between hardware makers.",
  "The 300W internal power supply uses blade connectors directly to the motherboard (not cables) and achieves over 92% efficiency in most scenarios. The custom Chicony power supply also serves as RF shielding. Total system power runs approximately 200W+ under typical load. The VRM includes 6 phases for GPU core, 2-3 phases for memory, and approximately 4 phases total for CPU split between different rails (VSoC, Vcore, etc.).",
  "Connectivity",
  "The system features four dedicated antennas: two for Wi-Fi 6E (2x2 configuration), one for Bluetooth, and one dedicated 2.4GHz radio for Steam Controller. The Wi-Fi antennas are oriented orthogonally to each other for polarity diversification, providing robust signal reception. The antennas are mounted to the heatsink for optimal positioning and intentionally separated by metal to minimize spectrum interference. This separation (versus the Deck's combined unit) ensures better reliability with no contention between devices.",
  "The Steam Machine's HDMI port is officially listed as HDMI 2.0, but the underlying hardware is actually HDMI 2.1 capable. Valve engineers have confirmed that select HDMI 2.1 features including HDR, AMD FreeSync, and VRR (Variable Refresh Rate) are active and functional, with the port tested at HDMI 2.1 speeds supporting 4K @ 120Hz. The limitation to the HDMI 2.0 designation is not a hardware constraint but a legal one: in February 2024, the HDMI Forum rejected AMD's proposal for open-source HDMI 2.1 driver implementation, making it impossible to officially support the full HDMI 2.1 specification in SteamOS's open-source Linux drivers without violating HDMI Forum licensing requirements. Users seeking full unrestricted display capabilities should use the DisplayPort 1.4 output, which supports up to 4K @ 240Hz or 8K @ 60Hz with no such limitations.",
  "Upgradeability & Repairability",
  "The system has a directly exposed SSD for easy replacement. It ships with M.2 2230 drives but supports full-size M.2 2280 drives. Valve chose the smaller drive purely for logistical reasons rather than paying a premium for the compact size. The microSD slot uses UHS-I standard, the same as Steam Deck, with no benefit from microSD Express.",
  "The DDR5 RAM uses laptop style SO-DIMM modules and is upgradable, but not very easily. The CPU and GPU are BGA soldered and not upgradeable due to thermal and size constraints, though a laptop-style BIOS is available with some frequency tuning options, albeit not as extensive as desktop motherboard BIOS. Valve has confirmed they're hoping to continue their Steam Deck partnership with iFixit to make replacement parts available for end users.",
  "Customization",
  "Customization options include a magnetic front panel where users can 3D print custom designs. Valve will release CAD files for the community. Examples shown include plain black, cherry red wood, Team Fortress 2 themed, and even an e-ink display showing temps and fan speed (an internal test project revealing the codename \"Fremont,\" not for sale but users could DIY). The customizable RGB light bar shows download progress, system status, and custom animations.",
  "Software Features",
  "Software features include fast suspend/resume within seconds, the ability to pause games and resume days or weeks later, and multiple game suspend capability (though one at a time is recommended). Background updates for OS, games, and cloud saves occur while the device is off, ensuring games are always ready to play. The LED bar shows progress even with the TV off.",
  "Valve has recently implemented a new zstd compression scheme for game downloads on Steam that requires significantly less CPU for decompression, reducing the computational overhead during game installation and updates. This improvement, combined with SteamOS optimizations for VRAM management and suspend/resume with discrete graphics (moving data between system RAM and VRAM, which wasn't needed on Steam Deck's unified memory APU), makes the Steam Machine capable of efficient background processing while maintaining low idle power consumption.",
  "Valve will provide Steamworks APIs that allow game developers to detect which platform they're running on, enabling games to automatically select optimal default settings for Steam Machine (similar to how many games already auto-detect Steam Deck settings). Desktop mode is fully capable, able to run Blender, browsers, and terminal applications, potentially serving as a primary PC for less demanding users. The system can also install Windows with the same support level as Steam Deck.",
  "For those planning to use Steam Machine as an all-in-one living room entertainment device, it's worth noting that Valve has no plans to offer bespoke media-streaming app downloads via the default SteamOS interface. Users will need to rely on streaming services functioning through Linux web browsers, and some services' DRM implementations may block access to Linux-based browsers by default.",
  "Pricing & DIY Options",
  "Valve positions the pricing as comparable to a similarly specced PC in the entry-level space, competitive with parts-based builds rather than console pricing. Unlike traditional consoles, Valve won't subsidize the hardware with game sales. This decision serves two purposes: it avoids competing with potential partners who might sell Steam games and software, and it acknowledges that the Steam Machine is a full-fledged PC capable of being used beyond gaming. While Valve is willing to work with select companies like Lenovo to bring future Steam Machines to market, partners are likely waiting to see how Valve's own machine performs first.",
  "For those interested in building their own Steam Machine, Valve won't be releasing a formal standalone SteamOS for custom hardware configurations anytime soon. However, Valve has expanded the list of supported third-party devices and has supported installing the Steam Deck recovery image on AMD CPU and GPU systems for some time, recently updating it to support their latest Zen 5 and RDNA4 architecture processors. Valve continues to actively improve hardware support, just recently they fixed booting issues on the latest AMD CPU platforms and added support for Intel Lunar Lake processors.",
  "Nothing prevents users from building their own Steam Machine and installing the software for free, though they will miss out on features like HDMI CEC control. The bulk of the experience should work pretty much out of the box, and a release supporting a broader range of hardware may come in the future, though this depends on better support for Intel and especially Nvidia GPUs.",
  "Hardware Specifications",
  "Steam Frame",
  "Steam Frame (codename Deckard) is a wireless VR headset powered by a Snapdragon 8 Gen 3 processor, running SteamOS. The device has been in development since at least 2019, predating the Steam Deck launch and the pandemic VR boom. Some engineers have been working on the project for approximately six years, starting immediately after the Valve Index. Inspired by both the Valve Index and Steam Deck, the device supports both VR and non-VR games from users' Steam libraries with standalone play capability.",
  "Hardware Design",
  "The headset features a modular design with a 185g core unit (compute, displays, and optics) that detaches via three toolless clips from the battery pack and headstrap. The multi-cell segmented battery provides a contoured back-of-head fit with 21.6Wh capacity. The core module can be separated from the headstrap for other headstrap solutions, enabling future third-party accessories. Valve chose the Snapdragon 8 Gen 3 over typical XR chips, prioritizing gaming performance with higher CPU frequencies (up to 3.3 GHz) and GPU clock speeds (900 MHz Adreno 750) better suited for FEX emulation and Proton translation layers.",
  "One of the most significant engineering challenges was optimizing memory bandwidth with cameras, displays, wireless streaming, CPU, and GPU all competing for access to the unified 16GB LPDDR5X memory simultaneously. According to Valve's engineers, managing this data flow complexity across all these subsystems was among the most complicated aspects of the entire device. The compact head-mounted form factor also required premium power delivery components to achieve the necessary power density in such limited space.",
  "Display & Optics",
  "The headset's displays use custom pancake lenses designed in-house with a generous eyebox and sharp edge-to-edge clarity. Valve chose LCD panels over OLED due to advantages in field of view, eyebox, cost, persistence, and weight. The displays feature modest canting similar to the Index for expanded horizontal FOV with nearly full binocular overlap, and the panels have truncated corners for nose clearance. Display brightness targets slightly above 100 nits at the eye, with an 8% duty cycle at all refresh rates. The headset supports super sampling at least 3,000 pixels wide in SteamVR settings.",
  "Comfort & Ergonomics",
  "Physical comfort features include a removable magnetic face gasket with spacer options for glasses and long eyelashes, a removable nose gasket that allows some air and light leak to reduce claustrophobia, and a physical IPD adjustment dial on top of the headset. The strap system uses soft ski goggle-style straps with an optional ergonomic top strap included in the accessory kit. Once adjusted, the straps don't need readjustment like ski goggles. Prescription lens inserts are planned, with Valve applying lessons learned from Index development challenges.",
  "Tracking & Foveated Streaming",
  "The tracking system delivers 200-250 controller updates per second, matching the Valve Index's performance. Eye tracking operates at 8-12ms update rates, meeting Valve's goals for stream quality. The headset features 18 IR LEDs per controller positioned strategically for full coverage, and can track in complete darkness using IR illumination.",
  "A key technology is foveated streaming, which only sends full high-quality content to where the user is looking. When the viewed area represents about one-tenth of the total pixel area, this effectively provides a 10x multiplier in bandwidth efficiency. This enables a 250 Mbps target bandwidth over Wi-Fi 7, with encoding latency of just 1-2ms on modern GPUs (4-5ms on older VR-capable GPUs) and total end-to-end latency of 10-20ms in good conditions. The foveated streaming window represents only about 10% of the total video stream.",
  "Controllers",
  "The controllers feature capacitive sensing on ABXY, D-pad, thumb rests, grips, and finger sensing capabilities. They have two-stage actuating triggers and grips, independent gyros in each controller that can be rebound for aiming, and can function as laser pointer mice with the grip button. Optional Index-style knuckles hand straps are available in the accessory kit. The controllers achieve 40-hour battery life per AA battery and are compatible with five-finger tracking like Index Knuckles controllers.",
  "Wireless Adapter",
  "The Steam Frame includes a 6GHz Wi-Fi 6E wireless adapter in the box, providing a dedicated point-to-point connection between the headset and PC for streaming. The adapter plugs into a PC via USB and establishes a direct connection to the headset's dedicated 6GHz radio, completely separate from general internet traffic. This approach gives Valve firmware-level control over the entire network stack and eliminates common wireless VR bottlenecks like router congestion, distance limitations, ISP-supplied equipment limitations, or interference from other devices.",
  "The headset's dual radio architecture is key to the streaming experience: one radio operates on 6GHz exclusively for VR streaming, while a second radio connects to home Wi-Fi on 5GHz or 2.4GHz for general internet connectivity. This dual-radio setup means there's no bandwidth competition between game streaming and other network activities, and it eliminates the extra network hop through a router that traditional wireless streaming requires.",
  "The headset can maintain quality streaming up to 15 meters away from the adapter with direct line of sight, and multiple headsets can operate concurrently in the same space.",
  "While enthusiasts with premium Wi-Fi 7 routers can technically bypass the included adapter and stream directly through their own equipment, Valve expects most users will prefer the included adapter for its plug-and-play simplicity and optimized performance. Steam Frame does not support DisplayPort or HDMI input, it is exclusively a wireless streaming and standalone device, with no tethered mode available.",
  "Audio",
  "The audio system features four 16mm drivers total (two per ear) with opposing driver orientation to cancel vibrations that could interfere with IMU tracking. The speakers project front-to-back, different from the Index's arm approach, resulting in more sound bleed than the Index as the speakers don't fire directly into the ears. The headset supports Bluetooth headphones and 3.5mm adapters. A dual microphone array on the bottom handles voice pickup, with Valve aiming to match the Index's reputation for microphone quality.",
  "Thermal Management",
  "The device runs approximately 7W when streaming and 20W+ when running games locally. Thermal management includes two heat pipes flanking the silicon with the PCB cleared for rear contact, a fin stack at the top near the brow line with ventilation pointed away from the user, and a single custom blower fan in the core module center governed by thermostats across the PCB plus chip sensors. The displays benefit from warmth, which actually helps LCD transition times at high refresh rates.",
  "Valve faced a unique thermal design challenge with dual temperature thresholds: the SoC's maximum operating temperature and the user's comfort threshold for heat on their face. Significant engineering effort went into thermally decoupling the hot components from where the headset contacts the user's skin, ensuring comfort during extended play sessions.",
  "The headset features approximately 10 external thermistors plus around 30 internal die temperature sensors throughout the device, providing a comprehensive thermal map. Custom fan curve algorithms read all sensor data and adjust fan speed based on workload type, with the fan running quietly during normal operation but capable of ramping up significantly for power users who want maximum performance.",
  "Software & Compatibility",
  "Software compatibility has been a major focus. Valve has been actively contributing to the FEX emulation layer for the past 1.5-2 years, enabling x86 Windows games to run on ARM processors through a combination of translation and emulation. Initially, most games didn't work, but about a year ago most games began functioning properly. The headset can run demanding titles smoothly in standalone mode, with 16GB of unified RAM enabling an extended portion of the Steam catalog to be played without streaming. Despite these standalone capabilities, Valve describes Steam Frame as a \"streaming-first\" device, with PC streaming expected to deliver the best experience for more demanding VR titles.",
  "As an example of this streaming-first approach, Valve's flagship VR title Half-Life: Alyx was only demonstrated via PC streaming at the press event. While Valve is exploring the possibility of standalone performance, they are not yet making any commitments about getting the game running natively on the headset's hardware. Notably, Valve has confirmed it is not currently developing new VR games for Steam Frame, a stark contrast to the Valve Index launch, where Half-Life: Alyx arrived less than a year after the headset. Steam Frame will instead rely on existing Steam VR titles and third-party content.",
  "The device offers four play modes: Local VR, Streaming VR, Local flat-screen (virtual cinema), and Streaming flat-screen. The virtual display supports configurable resolution and refresh rates for flat-screen gaming. Users can sideload Android APKs directly just like non-Steam applications on Steam Deck, with Valve expecting VR APKs that don't leverage proprietary APIs to work without issues. Desktop mode is available where users can launch windows at various sizes. According to Eurogamer, the core can even connect to a display via USB-C to function as a compact gaming PC.",
  "Pricing & Availability",
  "Valve confirmed the Index is no longer in production but will be supported indefinitely, and is open to conversations with other companies to manufacture Index accessories and components. The Steam Frame is positioned as a premium VR headset with Valve aiming for a price less than the Index, with consumer launch planned for early 2026.",
  "Hardware Specifications",
  "The expansion port under the nose bridge features 8 lanes @ 2.5Gbps MIPI camera interface / PCIe Gen 4 (1-lane), potentially supporting a color passthrough camera as a future addon.",
  "Steam Controller",
  "Steam Controller (codename Triton) features the same input capabilities as Steam Deck, designed to play all Steam games across multiple platforms. The original Steam Controller, discontinued in 2019 and liquidated for $5, focused on mouse and keyboard PC games but lacked functionality for traditional controller games. Despite this, it maintained a passionate fanbase for its unique capabilities.",
  "Input Technology",
  "The controller introduces next-generation TMR (Tunnel Magnetoresistance) magnetic thumbsticks, representing an evolution beyond Hall Effect technology with the same sensing fidelity but lower power consumption and minimal deadzone. The sticks are soldered rather than removable, reflecting Valve's confidence in their long-term reliability. They feature capacitive touch surfaces and a grippy texture similar to the Steam Deck OLED.",
  "The trackpads are squared like the Deck but slightly bigger and canted (rotated inwards) for more natural ergonomics in the controller form factor. They feature pressure sensitivity for configurable click strength and refined haptic feedback using motors similar to the Deck OLED. The D-pad has been reworked to stay centered more reliably with crisper diagonal presses compared to the base Steam Deck.",
  "Haptics & Ergonomics",
  "The controller features four grip buttons on the back that are naturally placed and easier to press than the Steam Deck's raised design. The haptic system includes four motors total: two LRA motors in the trackpads for HD tactile feedback, and two high-output LRA motors in the grips for HD game haptics including rumble. These linear motors have wider bandwidth performance, functioning like high-fidelity speakers in the haptics world, capable of replicating complex waveforms better than previous generations.",
  "GripSense & Gyro",
  "The controller includes GripSense capacitive sensors throughout, particularly in the right grip. The sensing is per-hand (not per-finger), providing continuous gradient feedback about grip proximity and pressure rather than individual finger tracking. This enables activating or deactivating the gyro simply by holding the controller normally, and can trigger other assignable effects beyond gyro. Users can configure the gyro to disable by loosening their grip to recenter, then reactivate by gripping again.",
  "Sensors are present on thumbsticks, trackpads, grips, and face buttons, covering all input surfaces. The 6-axis IMU provides gyro pointer functionality that allows the controller to function as a mouse cursor by pointing at the screen, with low-latency motion tracking and no external sensors required. The gyro can be activated via grip sense, thumb position, or button assignment.",
  "The controller's antenna uses a grounded design for ESD (electrostatic discharge) protection, a lesson learned from the Index. Positioned between the sticks in an ideal spot away from hands regardless of grip style, the design solves cost, functionality, and ESD protection simultaneously. The controller is user serviceable with a screwdriver, allowing access to the battery and components, though no official parts program has been announced.",
  "Design Philosophy & Features",
  "The controller is designed with simple plastics rather than rubberized grip textures, keeping costs down while maintaining high-quality inputs. It's notably lighter than traditional controllers, though it's not positioned as an \"Elite\" or \"Pro\" controller. Triggers aren't adjustable or adaptive, and buttons lack mouse-click clickiness. However, the trackpad can function as a mouse with left/right click, grip buttons can summon a laser pointer in VR, and users can leverage community controller profiles for keyboard-centric PC games.",
  "The controller's versatile input methods enable creative control schemes. For example, in Balatro, players can use the game's built-in controller compatibility, or configure the trackpads with the right for movement and left split for left/right click, or even use gyro mouse with face buttons for clicks. This flexibility showcases the controller's ability to adapt to different game types and player preferences.",
  "When used with Steam Frame, the controller includes IR LEDs for VR tracking, positioned beside the power LED to help users find the controller in VR. The Steam Machine has Puck functionality built-in, which means the included Puck is essentially extra and can be used on another PC or kept near the couch for convenient charging. All buttons feature capacitive sensing, including ABXY, D-pad, thumb rests, and grips. The two-stage actuating triggers provide precise analog input.",
  "Steam Controller Puck",
  "The Steam Controller Puck serves as both a wireless adapter and magnetic charging dock. The magnetic attachment provides quick snap-on/off, connecting only in the correct orientation thanks to magnetic shunts. Using the same wireless technology as the original Steam Controller, the Puck provides a proprietary 2.4GHz wireless connection with best-in-class 8ms effective latency and 250Hz polling rate (4ms polling interval) measured at 5 meters minimum range.",
  "Crucially, unlike Bluetooth where latency doubles with each additional controller, the 8ms latency remains consistent even with up to 4 Steam Controllers per Puck. For larger multiplayer scenarios, Valve has tested up to 4 Pucks on a single system for a maximum of 16 players. This connection is more stable than Bluetooth. While a device with good Bluetooth can perform well, consistency varies greatly with environment, and when multiple Bluetooth devices share bandwidth, it can cause lag and dropout.",
  "The controller also supports wired USB play with similar latency, though Bluetooth is slightly worse. The rechargeable Li-ion battery delivers 35+ hours of play time conservatively and can be charged via the Puck or USB.",
  "The Puck supports re-pairing to different devices, enabling seamless switching between systems. For example, users who purchase the Steam Machine + Steam Controller bundle will have both a standalone Puck and the integrated receiver in the Steam Machine. The controller can store pairing information for both, allowing users to switch between their Steam Machine and desktop PC without entering any UI or reprogramming. Valve is also adapting Aperture Hand Lab to work as a tutorial for the Steam Controller, similar to the tutorial available for Steam Deck: Aperture Desk Job.",
  "Hardware Specifications",
  "Ecosystem Integration",
  "All three devices are designed to work together as an integrated ecosystem. MicroSD cards are hot-swappable between Steam Deck, Steam Machine, and Steam Frame, allowing instant library transfers by simply moving the card between devices. The Steam Machine can stream games to Steam Frame, Steam Deck, phones, tablets, and laptops.",
  "While the Steam Machine has the Steam Controller Puck functionality built-in, the Steam Frame wireless adapter is NOT integrated into the Steam Machine. To stream VR games from Steam Machine to Steam Frame, users need to plug the included Steam Frame wireless adapter into one of the front USB-C ports, which is specifically positioned for this purpose.",
  "Although the Steam Machine includes a capable Wi-Fi 6E radio, Valve recommends using the dedicated adapter because streaming VR while maintaining internet connectivity requires two separate Wi-Fi radios — one for the 6GHz VR streaming connection and another for general network access.",
  "According to Valve, the collaboration between their hardware and software engineering teams on Steam Machine makes SteamOS better for everyone. Third-party gaming PCs and handheld devices that run SteamOS benefit from improvements developed for Valve's own hardware. This creates a virtuous cycle where Valve's hardware development drives platform improvements that enhance the entire SteamOS ecosystem, making it more viable for other manufacturers and DIY builders.",
  "Steam's platform features over 100,000 titles from practically every publisher, with 30 million active players at any given moment. Former console exclusives like Halo, God of War, and Spider-Man are now available on Steam. Valve is expanding the Verified program with Steam Machine Verified, allowing customers to understand how their games will run on the device. Games that are Steam Deck Verified will automatically receive Steam Machine Verified status. A Frame Verified program is also coming to verify both flat-screen and local VR standalone content on the Steam Frame.",
  "What About Steam Deck 2?",
  "Don't expect a Steam Deck 2 anytime soon. While Valve was clear this announcement wasn't about the future of Steam Deck, they addressed the topic when asked by press. According to Valve, they're interested to work on what's next for Steam Deck, but are waiting for a truly worthwhile performance upgrade rather than rushing to market with incremental improvements.",
  "Valve stated they are not interested in releasing a Steam Deck 2 with only 20%, 30%, or even 50% more performance at the same battery life. They want something more substantial - a genuine generational leap. The company has been researching silicon advancements and architectural improvements, and believes they have a pretty good idea of what the next version of Steam Deck is going to be.",
  "The problem? No current SOC offerings in the market meet Valve's criteria for what they consider \"truly next-gen performance\" for a Steam Deck successor. Until the silicon landscape evolves to enable that significant performance jump while maintaining the portable form factor and battery life expectations, Valve appears content to let the current Steam Deck (and its OLED variant) continue serving the handheld gaming market.",
  "Availability",
  "All three products will be available in regions where Steam Deck currently ships (United States, Canada, United Kingdom, European Union, and Australia), as well as in Japan, South Korea, Hong Kong, and Taiwan through KOMODO.",
  "Valve plans to begin shipping in early 2026, with specific launch dates and pricing to be announced after the new year. The products are currently available for wishlisting on Steam's official hardware pages.",
  "Conclusion",
  "Ten years ago, Valve's living room ambitions stumbled on immature software and fragmented hardware partnerships. This time, they're doing it themselves, and the software is finally ready. SteamOS has matured through the Steam Deck's success, Proton has unlocked the Windows gaming catalog on Linux, and FEX emulation is making ARM-based VR viable.",
  "Valve has clearly learned from 2015. The real question is whether the PC gaming market is ready to embrace a console-like experience when building your own rig has been the default for decades. Steam Machine targets the living room, Steam Frame bets on standalone VR's future, and the new Steam Controller bridges both worlds with the flexibility PC gamers expect.",
  "Valve's ecosystem play is ambitious: hot-swappable microSD cards between devices, native VR streaming between Steam Machine and Steam Frame, and improvements that benefit the entire SteamOS community. If the pricing lands right and the software delivers on its promises, early 2026 could mark the moment PC gaming finally cracks the living room. For real this time.",
  "Sources",
  "The information in this article has been collected and summarized from official pages, the press release, and other multiple sources, including Dave2D, Digital Foundry, Eurogamer, Gamers Nexus [2], Giant Bomb, IGN, Linus Tech Tips [2], PC Gamer, Rock Paper Shotgun, Tested [2], The Verge.",
  "Additional information, including product specifications, can be found on the official Steam Hardware pages and the new Steam Hardware Blog.",
  "Have feedback on this post? Join our Discord",
  "SteamDB extension update: Steam Community achievements page overhaul",
  "Valve announces Steam Deck OLED",
  "Steam switched Argentina and Turkey to USD pricing beginning November 20th",
  "New Steam recommended regional pricing",
  "Limits on downloading old game versions indicated in new Steam Beta",
  "About",
  "Blog",
  "Discord",
  "Discord Bot",
  "FAQ & help",
  "Donate & contribute",
  "Browser extension",
  "Discovery",
  "Sales & Deals",
  "Upcoming releases",
  "Release calendar",
  "Free promotions",
  "Bundles",
  "Price changes",
  "When is next sale?",
  "Tools",
  "Charts",
  "Calculator",
  "Patch notes",
  "Search",
  "Instant search",
  "Steam Status",
  "Steam Web API",
  "Database",
  "Game tags",
  "Developers",
  "Publishers",
  "Profile badges",
  "Engines & technologies",
  "Game releases by year",
  "Change history",
  "Rankings",
  "Top rated games",
  "Global top sellers",
  "Weekly top sellers",
  "Most followed games",
  "Most wishlisted games",
  "Wishlist activity",
  "Daily active users",
  "Top game owners",
  "Top profile levels",
  "Account",
  "Sign in via Steam",
  "Free packages",
  "SteamDB is a hobby project and is not affiliated with Valve or Steam. All times on the site are UTC.\nFair use disclaimer ·\nPrivacy",
  "Steam and the Steam logo are trademarks of Valve Corporation. All other trademarks are property of their respective owners.",
  "What To Play\n                \n            \n                                \n                \n                    What to Watch",
  "What To Play",
  "What to Watch",
  "Guides\n                            Submenu\n                        \n                                        \n\n                    \n                            \n                        \n                \n                    All Guides\n                \n            \n                                \n                \n                    All Maps\n                \n            \n                                \n                \n                    Pokémon Go\n                \n            \n                                \n                \n                    Donkey Kong Bananza\n                \n            \n                                \n                \n                    Clair Obscur: Expedition 33\n                \n            \n            \n\n                    \n                \n                                                            \n                                                                \n                        \n                            Games\n                            Submenu\n                        \n                                        \n\n                    \n                            \n                        \n                \n                    All Gaming\n                \n            \n                                \n                \n                    Tabletop\n                \n            \n            \n\n                    \n                \n                                                            \n                                                                \n                        \n                            Entertainment\n                            Submenu\n                        \n                                        \n\n                    \n                            \n                        \n                \n                    All Entertainment\n                \n            \n                                \n                \n                    Anime\n                \n            \n                                \n                \n                    Horror\n                \n            \n                                \n                \n                    Sci-Fi\n                \n            \n                                \n                \n                    Fantasy\n                \n            \n            \n\n                    \n                \n                                            \n                \n                    Videos",
  "Guides\n                            Submenu\n                        \n                                        \n\n                    \n                            \n                        \n                \n                    All Guides\n                \n            \n                                \n                \n                    All Maps\n                \n            \n                                \n                \n                    Pokémon Go\n                \n            \n                                \n                \n                    Donkey Kong Bananza\n                \n            \n                                \n                \n                    Clair Obscur: Expedition 33",
  "All Guides",
  "All Maps",
  "Pokémon Go",
  "Donkey Kong Bananza",
  "Clair Obscur: Expedition 33",
  "Games\n                            Submenu\n                        \n                                        \n\n                    \n                            \n                        \n                \n                    All Gaming\n                \n            \n                                \n                \n                    Tabletop",
  "All Gaming",
  "Tabletop",
  "Entertainment\n                            Submenu\n                        \n                                        \n\n                    \n                            \n                        \n                \n                    All Entertainment\n                \n            \n                                \n                \n                    Anime\n                \n            \n                                \n                \n                    Horror\n                \n            \n                                \n                \n                    Sci-Fi\n                \n            \n                                \n                \n                    Fantasy",
  "All Entertainment",
  "Anime",
  "Horror",
  "Sci-Fi",
  "Fantasy",
  "Videos",
  "Sign in",
  "Newsletter",
  "Experts say its specs put it between Xbox Series S and PlayStation 5, and it’s obviously built to a price point",
  "Related",
  "Valve is cutting corners with Steam Machine to compete with the current consoles",
  "Just how powerful will the Steam Machine be? Based on expert analysis of the specs revealed by Valve when it announced the Steam Machine on Wednesday, its new compact, console-like gaming PC is aimed straight at the capabilities of the current generation of home consoles: Xbox Series X and PlayStation 5. It should be able to play the same games to a similar level of fidelity. But there are compromises in its spec that suggest that Valve has been very cost-conscious when designing the machine, and is hoping to make it as affordable as possible.",
  "Valve demonstrated the Steam Machine to a range of tech and gaming publications before its announcement. Among them was Digital Foundry, which as usual has provided an extremely thorough analysis of the new device’s capabilities, informed by hands-on experience at Valve as well as testing of parts similar to those included in the device. If you’re curious to dig deep into the tech behind Valve’s new game cube, I highly recommend you give DF’s analysis a watch or a read.",
  "Here is the TL;DR version: The Steam Machine broadly sits with the current-gen consoles in terms of power, but its spec — particularly its graphics processing unit (GPU) — puts it a little behind PS5 and Xbox Series X. Digital Foundry says “its spec sheet suggests performance at some mid-way point between Xbox Series S and the standard PlayStation 5, perhaps skewing more closely to the Sony console.”",
  "The AMD Zen 4 central processing unit (CPU) with its 16 GB of RAM isn’t the problem. In terms of computing brain power, the Steam Machine is more than adequate. The issue is the pixel-pushing muscle supplied by the GPU. This “semi-custom” AMD RDNA 3 unit appears to be a cut-down version of the RX 7600, a so-so mid-range graphics card from two years ago. (Moore’s Law is Dead reckons it’s “almost exactly” a 7600M, a laptop variant of that card.)",
  "Additionally, this GPU has just 8 GB of VRAM to work with. The consoles have more; Xbox Series X allocates 10 GB of RAM to its GPU, while PS5 dynamically allocates some but not all of its 16 GB, estimated to be in the 10-12 GB range. Practically, 8 GB of VRAM presents a bottleneck in storing information for graphically rich games which can impact performance. It’s enough of a worry for DF’s Richard Leadbetter to say he’d like to see Valve introduce 16 GB of VRAM as a purchasing option for the Steam Machine.",
  "At these specs, Valve’s claim that the Steam Machine is capable of 4K, 60 frames per second gaming seems rather misleading — even allowing for its caveat that this level of performance is enabled with FSR, AMD’s machine-learning upscaling tech. Obviously, performance depends on the game and its settings. But for contemporary AAA games, the Sony and Microsoft consoles have largely proved incapable of 4K/60 — they tend to operate at 1440p/60, or 4K/30 — so it certainly won’t be true of the slightly weaker Steam Machine. Leadbetter says he expects the Steam Machine to excel at 1080p gaming, hence the Series S comparison.",
  "Also like the Series S, the base model of Steam Machine will come with just 512 GB of storage. (There will also be a 2 TB model.) Anyone who has used a Series S for a while will know that this isn’t really enough for modern game sizes, and requires constant deleting and redownloading of games. The fast SSD storage that the current gen consoles use is expensive, as you can tell from their price points: the 1 TB Series S is $50 more than the 512 GB model, while the 2 TB special edition Series X is $150 more than the standard machine. Sony, meanwhile, has tried to keep a lid on prices by lowering the amount of storage in its entry-level PS5 Digital Edition from 1 TB to 825 GB.",
  "What the Steam Machine’s specs tell you is that Valve’s priority has been to keep the cost of the device down in a challenging moment when gaming hardware is getting more and more expensive. The fact that it’s offering a 512 GB option at all shows how keen it is to hit a low entry-level price point. This is reinforced in all the interviews that Valve has given, where “affordability” is a constant theme. Valve told Digital Foundry that it was balancing cost against a spec that would be an upgrade for the majority of Steam users, according to its hardware surveys.",
  "The Steam Machine will probably compare favorably on price, spec, and definitely design with entry-level gaming PCs. Whether it can do the same with the consoles is the million-dollar question. Valve isn’t necessarily a big enough manufacturer to take advantage of the kind of economies of scale that Microsoft and Sony have access to. We’ll analyze the likely price of the Steam Machine in a separate piece, but what we can tell for now is that Valve is working hard, and cutting a few corners, to be able to compete with the consoles.",
  "Analysis",
  "Hardware",
  "PC",
  "We want to hear from you! Share your opinions in the thread below and remember to keep it respectful.",
  "Your comment has not been saved",
  "Menage\n\n                                                        \n                \n                                                            \n                                    \n                                                    \n                                    \n                \n                    \n                    \n        \n                            \n                                                                        Menage\n                                            \n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        \n                        \n\n\n\n\n                                        \n\n    \n\n\n\n    \n\n\n        \n            \n\n                                                            \n                                                                \n\n            \n                \n                    Menage\n                                                                                \n                \n                    #YX857701\n\n                    \n                                                                                \n\n            \n        \n\n\n                    \n                                    Member since 2022-05-26\n                            \n        \n        \n            \n                \n                                                                    \n                                \n                                            \n\n        \n\n        \n            \n                                                                                                        \n                Following\n\n                                                \n                    0\n                    Topics\n                \n                                                                 \n                    0\n                    Users\n                \n                \n            \n        \n        \n                        \n                                                                                \n                \n                                                                                            \n                                \n            \n                        \n            \n                \n                \n                                                                        Follow\n                                                            \n            \n\n            \n                \n                \n                                                            Followed\n                                                    \n            \n        \n                                                                0  Followers \n                                    \n            \n                        View\n        \n    \n\n\n\n\n                                    \n            \n            \n                    \n        \n    \n        \n\n\n\n    \n    \n\n    \n\n\n\n    \n            \n    \n\n\n            \n\n\n\n\n            I def see 8 very clear corners \n                    2025-11-13 15:08:10\n            \n    \n    \n    \n    \n            \n\n    \n    \n        \n\n    \n\n        \n                                    \n\n\n    \n\n    \n    \n    \n\n\n    \n    \n        Upvote\n            \n                                    8\n                            \n        \n        Downvote\n    \n                                \n                \n                    Reply\n                    \n                        \n                    \n                \n            \n                                                                                                \n                                                        Copy",
  "I def see 8 very clear corners",
  "PierogiPrince\n\n                                                        \n                \n                                                            \n                                    \n                                                    \n                                    \n                \n                    \n                    \n        \n                            \n                                                                        PierogiPrince\n                                            \n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        \n                        \n\n\n\n\n                                        \n\n    \n\n\n\n    \n\n\n        \n            \n\n                                                            \n                                                                \n\n            \n                \n                    PierogiPrince\n                                                                                \n                \n                    #EX520045\n\n                    \n                                                                                \n\n            \n        \n\n\n                    \n                                    Member since 2013-08-05\n                            \n        \n        \n            \n                \n                                                                    \n                                \n                                            \n\n        \n\n        \n            \n                                                                                                        \n                Following\n\n                                                \n                    0\n                    Topics\n                \n                                                                 \n                    0\n                    Users\n                \n                \n            \n        \n        \n                        \n                                                                                \n                \n                                                                                            \n                                \n            \n                        \n            \n                \n                \n                                                                        Follow\n                                                            \n            \n\n            \n                \n                \n                                                            Followed\n                                                    \n            \n        \n                                                                0  Followers \n                                    \n            \n                        View\n        \n    \n\n\n\n\n                                    \n            \n            \n                    \n        \n    \n        \n\n\n\n    \n    \n\n    \n\n\n\n    \n            \n    \n\n\n            \n\n\n\n\n            I think this will still probably get the job done for most people and it'll sell well enough to justify the experiment, which I think was the plan for the Deck as well. They could even take a hit on it and be fine. I don't think they really expect this to replace the Xbox or PS5. \n                    2025-11-13 13:14:59\n            \n    \n    \n    \n    \n            \n\n    \n    \n        \n\n    \n\n        \n                                    \n\n\n    \n\n    \n    \n    \n\n\n    \n    \n        Upvote\n            \n                                    5\n                            \n        \n        Downvote\n    \n                                \n                \n                    Reply\n                    \n                        \n                    \n                \n            \n                                                                                                \n                                                        Copy",
  "I think this will still probably get the job done for most people and it'll sell well enough to justify the experiment, which I think was the plan for the Deck as well. They could even take a hit on it and be fine. I don't think they really expect this to replace the Xbox or PS5.",
  "ChaseHammer\n\n                                                        \n                \n                                                            \n                                    \n                                                    \n                                    \n                \n                    \n                    \n        \n                            \n                                                                        ChaseHammer\n                                            \n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        \n                        \n\n\n\n\n                                        \n\n    \n\n\n\n    \n\n\n        \n            \n\n                                                            \n                                                                \n\n            \n                \n                    ChaseHammer\n                                                                                \n                \n                    #QP637688\n\n                    \n                                                                                \n\n            \n        \n\n\n                    \n                                    Member since 2022-06-21\n                            \n        \n        \n            \n                \n                                                                    \n                                \n                                            \n\n        \n\n        \n            \n                                                                                                        \n                Following\n\n                                                \n                    0\n                    Topics\n                \n                                                                 \n                    0\n                    Users\n                \n                \n            \n        \n        \n                        \n                                                                                \n                \n                                                                                            \n                                \n            \n                        \n            \n                \n                \n                                                                        Follow\n                                                            \n            \n\n            \n                \n                \n                                                            Followed\n                                                    \n            \n        \n                                                                0  Followers \n                                    \n            \n                        View\n        \n    \n\n\n\n\n                                    \n            \n            \n                    \n        \n    \n        \n\n\n\n    \n    \n\n    \n\n\n\n    \n            \n    \n\n\n            \n\n\n\n\n            The HDMI port not being true 2.1 will come back to bite them.\n                    2025-11-13 13:06:16\n            \n    \n    \n    \n    \n            \n\n    \n    \n        \n\n    \n\n        \n                                    \n\n\n    \n\n    \n    \n    \n\n\n    \n    \n        Upvote\n            \n                                    5\n                            \n        \n        Downvote\n    \n                                \n                \n                    Reply\n                    \n                        18\n                    \n                \n            \n                                                                                                \n                                                        Copy",
  "The HDMI port not being true 2.1 will come back to bite them.",
  "Cory\n\n                                                        \n                \n                                                            \n                                    \n                                                    \n                                    \n                \n                    \n                    \n        \n                            \n                                                                        Cory\n                                            \n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        \n                        \n\n\n\n\n                                        \n\n    \n\n\n\n    \n\n\n        \n            \n\n                                                            \n                                                                \n\n            \n                \n                    Cory\n                                                                                \n                \n                    #DF236559\n\n                    \n                                                                                \n\n            \n        \n\n\n                    \n                                    Member since 2025-08-06\n                            \n        \n        \n            \n                \n                                                                    \n                                \n                                            \n\n        \n\n        \n            \n                                                                                                        \n                Following\n\n                                                \n                    0\n                    Topics\n                \n                                                                 \n                    0\n                    Users\n                \n                \n            \n        \n        \n                        \n                                                                                \n                \n                                                                                            \n                                \n            \n                        \n            \n                \n                \n                                                                        Follow\n                                                            \n            \n\n            \n                \n                \n                                                            Followed\n                                                    \n            \n        \n                                                                0  Followers \n                                    \n            \n                        View\n        \n    \n\n\n\n\n                                    \n            \n            \n                    \n        \n    \n        \n\n\n\n    \n    \n\n    \n\n\n\n    \n            \n    \n\n\n            \n\n\n\n\n            Not for an essentially 1080p gaming device.\n                    2025-11-13 13:43:29\n            \n    \n    \n    \n    \n            \n\n    \n    \n        \n\n    \n\n        \n                                    \n\n\n    \n\n    \n    \n    \n\n\n    \n    \n        Upvote\n            \n                                    4\n                            \n        \n        Downvote\n    \n                                \n                \n                    Reply\n                \n            \n                                                                                                \n                                                        Copy",
  "Not for an essentially 1080p gaming device.",
  "ChaseHammer\n\n                                                        \n                \n                                                            \n                                    \n                                                    \n                                    \n                \n                    \n                    \n        \n                            \n                                                                        ChaseHammer\n                                            \n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        \n                        \n\n\n\n\n                                        \n\n    \n\n\n\n    \n\n\n        \n            \n\n                                                            \n                                                                \n\n            \n                \n                    ChaseHammer\n                                                                                \n                \n                    #QP637688\n\n                    \n                                                                                \n\n            \n        \n\n\n                    \n                                    Member since 2022-06-21\n                            \n        \n        \n            \n                \n                                                                    \n                                \n                                            \n\n        \n\n        \n            \n                                                                                                        \n                Following\n\n                                                \n                    0\n                    Topics\n                \n                                                                 \n                    0\n                    Users\n                \n                \n            \n        \n        \n                        \n                                                                                \n                \n                                                                                            \n                                \n            \n                        \n            \n                \n                \n                                                                        Follow\n                                                            \n            \n\n            \n                \n                \n                                                            Followed\n                                                    \n            \n        \n                                                                0  Followers \n                                    \n            \n                        View\n        \n    \n\n\n\n\n                                    \n            \n            \n                    \n        \n    \n        \n\n\n\n    \n    \n\n    \n\n\n\n    \n            \n    \n\n\n            \n\n\n\n\n            They are pushing this as 4K so no.\n                    2025-11-13 14:13:22\n            \n    \n    \n    \n    \n            \n\n    \n    \n        \n\n    \n\n        \n                                    \n\n\n    \n\n    \n    \n    \n\n\n    \n    \n        Upvote\n            \n                                    3\n                            \n        \n        Downvote\n    \n                                \n                \n                    Reply\n                \n            \n                                                                                                \n                                                        Copy",
  "They are pushing this as 4K so no.",
  "DexCharisma\n\n                                                        \n                \n                                                            \n                                    \n                                                    \n                                    \n                \n                    \n                    \n        \n                            \n                                                                        DexCharisma\n                                            \n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        \n                        \n\n\n\n\n                                        \n\n    \n\n\n\n    \n\n\n        \n            \n\n                                                            \n                                                                \n\n            \n                \n                    DexCharisma\n                                                                                \n                \n                    #RV211364\n\n                    \n                                                                                \n\n            \n        \n\n\n                    \n                                    Member since 2025-02-10\n                            \n        \n        \n            \n                \n                                                                    \n                                \n                                            \n\n        \n\n        \n            \n                                                                                                        \n                Following\n\n                                                \n                    0\n                    Topics\n                \n                                                                 \n                    0\n                    Users\n                \n                \n            \n        \n        \n                        \n                                                                                \n                \n                                                                                            \n                                \n            \n                        \n            \n                \n                \n                                                                        Follow\n                                                            \n            \n\n            \n                \n                \n                                                            Followed\n                                                    \n            \n        \n                                                                0  Followers \n                                    \n            \n                        View\n        \n    \n\n\n\n\n                                    \n            \n            \n                    \n        \n    \n        \n\n\n\n    \n    \n\n    \n\n\n\n    \n            \n    \n\n\n            \n\n\n\n\n            ChaseHammer I guess if you want to run it on LOW.\n                    2025-11-13 14:26:55\n            \n    \n    \n    \n    \n            \n\n    \n    \n        \n\n    \n\n        \n                                    \n\n\n    \n\n    \n    \n    \n\n\n    \n    \n        Upvote\n            \n                                    4\n                            \n        \n        Downvote\n    \n                                \n                \n                    Reply\n                \n            \n                                                                                                \n                                                        Copy",
  "ChaseHammer I guess if you want to run it on LOW.",
  "habilain\n\n                                                        \n                \n                                                            \n                                    \n                                                    \n                                    \n                \n                    \n                    \n        \n                            \n                                                                        habilain\n                                            \n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        \n                        \n\n\n\n\n                                        \n\n    \n\n\n\n    \n\n\n        \n            \n\n                                                            \n                                                                \n\n            \n                \n                    habilain\n                                                                                \n                \n                    #TY136536\n\n                    \n                                                                                \n\n            \n        \n\n\n                    \n                                    Member since 2022-05-26\n                            \n        \n        \n            \n                \n                                                                    \n                                \n                                            \n\n        \n\n        \n            \n                                                                                                        \n                Following\n\n                                                \n                    0\n                    Topics\n                \n                                                                 \n                    0\n                    Users\n                \n                \n            \n        \n        \n                        \n                                                                                \n                \n                                                                                            \n                                \n            \n                        \n            \n                \n                \n                                                                        Follow\n                                                            \n            \n\n            \n                \n                \n                                                            Followed\n                                                    \n            \n        \n                                                                0  Followers \n                                    \n            \n                        View\n        \n    \n\n\n\n\n                                    \n            \n            \n                    \n        \n    \n        \n\n\n\n    \n    \n\n    \n\n\n\n    \n            \n    \n\n\n            \n\n\n\n\n            On a hardware level, the port is HDMI 2.1 (as it's an RDNA3 GPU). The HDMI consortium has been blocking fully compliant HDMI 2.1 drivers on AMD+Linux for a while, which is the reason it's being advertised as HDMI 2.0.That said, Valve has state the port does do 4k/120Hz, which is pretty much the relevant part for gaming. It's missing some other features of HDMI 2.1 which might come via software update if the HDMI consortium changes their minds. Most likely, the missing features are on the HDCP (i.e. DRM), DSC schema and maybe some of the HDR stuff, but until the hardware gets released we won't know exactly what's missing.\n                    2025-11-13 15:20:41\n            \n    \n    \n    \n    \n            \n\n    \n    \n        \n\n    \n\n        \n                                    \n\n\n    \n\n    \n    \n    \n\n\n    \n    \n        Upvote\n            \n                                    9\n                            \n        \n        Downvote\n    \n                                \n                \n                    Reply\n                \n            \n                                                                                                \n                                                        Copy",
  "On a hardware level, the port is HDMI 2.1 (as it's an RDNA3 GPU). The HDMI consortium has been blocking fully compliant HDMI 2.1 drivers on AMD+Linux for a while, which is the reason it's being advertised as HDMI 2.0.",
  "That said, Valve has state the port does do 4k/120Hz, which is pretty much the relevant part for gaming. It's missing some other features of HDMI 2.1 which might come via software update if the HDMI consortium changes their minds. Most likely, the missing features are on the HDCP (i.e. DRM), DSC schema and maybe some of the HDR stuff, but until the hardware gets released we won't know exactly what's missing.",
  "Swerving\n\n                                                        \n                \n                                                            \n                                    \n                                                    \n                                    \n                \n                    \n                    \n        \n                            \n                                                                        Swerving\n                                            \n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        \n                        \n\n\n\n\n                                        \n\n    \n\n\n\n    \n\n\n        \n            \n\n                                                            \n                                                                \n\n            \n                \n                    Swerving\n                                                                                \n                \n                    #CS895448\n\n                    \n                                                                                \n\n            \n        \n\n\n                    \n                                    Member since 2025-11-13\n                            \n        \n        \n            \n                \n                                                                    \n                                \n                                            \n\n        \n\n        \n            \n                                                                                                        \n                Following\n\n                                                \n                    0\n                    Topics\n                \n                                                                 \n                    0\n                    Users\n                \n                \n            \n        \n        \n                        \n                                                                                \n                \n                                                                                            \n                                \n            \n                        \n            \n                \n                \n                                                                        Follow\n                                                            \n            \n\n            \n                \n                \n                                                            Followed\n                                                    \n            \n        \n                                                                0  Followers \n                                    \n            \n                        View\n        \n    \n\n\n\n\n                                    \n            \n            \n                    \n        \n    \n        \n\n\n\n    \n    \n\n    \n\n\n\n    \n            \n    \n\n\n            \n\n\n\n\n            It would, if anyone actually cared about 4k gaming. The steam hardware survey seems to suggest that not many do (<10% running at resolutions higher than 1440p).HST - it's actually capable of 4k 120hz but I wouldn't expect stellar framerates or lots of features, even though it's running on a hyper-optimized linux.\n                    2025-11-13 15:45:59\n            \n    \n    \n    \n    \n            \n\n    \n    \n        \n\n    \n\n        \n                                    \n\n\n    \n\n    \n    \n    \n\n\n    \n    \n        Upvote\n            \n                                    4\n                            \n        \n        Downvote\n    \n                                \n                \n                    Reply\n                \n            \n                                                                                                \n                                                        Copy",
  "It would, if anyone actually cared about 4k gaming. The steam hardware survey seems to suggest that not many do (<10% running at resolutions higher than 1440p).",
  "HST - it's actually capable of 4k 120hz but I wouldn't expect stellar framerates or lots of features, even though it's running on a hyper-optimized linux.",
  "DexCharisma\n\n                                                        \n                \n                                                            \n                                    \n                                                    \n                                    \n                \n                    \n                    \n        \n                            \n                                                                        DexCharisma\n                                            \n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        \n                        \n\n\n\n\n                                        \n\n    \n\n\n\n    \n\n\n        \n            \n\n                                                            \n                                                                \n\n            \n                \n                    DexCharisma\n                                                                                \n                \n                    #RV211364\n\n                    \n                                                                                \n\n            \n        \n\n\n                    \n                                    Member since 2025-02-10\n                            \n        \n        \n            \n                \n                                                                    \n                                \n                                            \n\n        \n\n        \n            \n                                                                                                        \n                Following\n\n                                                \n                    0\n                    Topics\n                \n                                                                 \n                    0\n                    Users\n                \n                \n            \n        \n        \n                        \n                                                                                \n                \n                                                                                            \n                                \n            \n                        \n            \n                \n                \n                                                                        Follow\n                                                            \n            \n\n            \n                \n                \n                                                            Followed\n                                                    \n            \n        \n                                                                0  Followers \n                                    \n            \n                        View\n        \n    \n\n\n\n\n                                    \n            \n            \n                    \n        \n    \n        \n\n\n\n    \n    \n\n    \n\n\n\n    \n            \n    \n\n\n            \n\n\n\n\n            Swerving Can you even buy a TV that isn't 4K these days? This thing was designed for the living room, not a 27\" monitor. 4K is the new standard. Not 1080, not 1440, not 1080 with FSR.\n                    2025-11-13 16:29:06\n            \n    \n    \n    \n    \n            \n\n    \n    \n        \n\n    \n\n        \n                                    \n\n\n    \n\n    \n    \n    \n\n\n    \n    \n        Upvote\n            \n                                    4\n                            \n        \n        Downvote\n    \n                                \n                \n                    Reply\n                \n            \n                                                                                                \n                                                        Copy",
  "Swerving Can you even buy a TV that isn't 4K these days? This thing was designed for the living room, not a 27\" monitor. 4K is the new standard. Not 1080, not 1440, not 1080 with FSR.",
  "JakeWinterScones\n\n                                                        \n                \n                                                            \n                                    \n                                                    \n                                    \n                \n                    \n                    \n        \n                            \n                                                                        JakeWinterScones\n                                            \n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        \n                        \n\n\n\n\n                                        \n\n    \n\n\n\n    \n\n\n        \n            \n\n                                                            \n                                                                \n\n            \n                \n                    JakeWinterScones\n                                                                                \n                \n                    #BV329323\n\n                    \n                                                                                \n\n            \n        \n\n\n                    \n                                    Member since 2023-12-13\n                            \n        \n        \n            \n                \n                                                                    \n                                \n                                            \n\n        \n\n        \n            \n                                                                                                        \n                Following\n\n                                                \n                    0\n                    Topics\n                \n                                                                 \n                    0\n                    Users\n                \n                \n            \n        \n        \n                        \n                                                                                \n                \n                                                                                            \n                                \n            \n                        \n            \n                \n                \n                                                                        Follow\n                                                            \n            \n\n            \n                \n                \n                                                            Followed\n                                                    \n            \n        \n                                                                0  Followers \n                                    \n            \n                        View\n        \n    \n\n\n\n\n                                    \n            \n            \n                    \n        \n    \n        \n\n\n\n    \n    \n\n    \n\n\n\n    \n            \n    \n\n\n            \n\n\n\n\n            All other complaints meh. If Valve can keep the price down, I see this as a big win for people who wants to game but couldn't afford gaming PCs or consoles, even mediocre ones. Nintendo could have been in there, somewhat, but they started the trend of increasing game prices. \n                    2025-11-13 17:48:56\n            \n    \n    \n    \n    \n            \n\n    \n    \n        \n\n    \n\n        \n                                    \n\n\n    \n\n    \n    \n    \n\n\n    \n    \n        Upvote\n            \n                                    4\n                            \n        \n        Downvote\n    \n                                \n                \n                    Reply\n                    \n                        2\n                    \n                \n            \n                                                                                                \n                                                        Copy",
  "All other complaints meh.",
  "If Valve can keep the price down, I see this as a big win for people who wants to game but couldn't afford gaming PCs or consoles, even mediocre ones. Nintendo could have been in there, somewhat, but they started the trend of increasing game prices.",
  "versatile-tech-user\n\n                                                        \n                \n                                                            \n                                    \n                                                    \n                                    \n                \n                    \n                    \n        \n                            \n                                                                        versatile-tech-user\n                                            \n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        \n                        \n\n\n\n\n                                        \n\n    \n\n\n\n    \n\n\n        \n            \n\n                                                            \n                                                                \n\n            \n                \n                    versatile-tech-user\n                                                                                \n                \n                    #DY535184\n\n                    \n                                                                                \n\n            \n        \n\n\n                    \n                                    Member since 2012-04-27\n                            \n        \n        \n            \n                \n                                                                    \n                                \n                                            \n\n        \n\n        \n            \n                                                                                                        \n                Following\n\n                                                \n                    0\n                    Topics\n                \n                                                                 \n                    0\n                    Users\n                \n                \n            \n        \n        \n                        \n                                                                                \n                \n                                                                                            \n                                \n            \n                        \n            \n                \n                \n                                                                        Follow\n                                                            \n            \n\n            \n                \n                \n                                                            Followed\n                                                    \n            \n        \n                                                                0  Followers \n                                    \n            \n                        View\n        \n    \n\n\n\n\n                                    \n            \n            \n                    \n        \n    \n        \n\n\n\n    \n    \n\n    \n\n\n\n    \n            \n    \n\n\n            \n\n\n\n\n            I think people are being overly harsh about Nintendo raising prices when games pretty much have been $80 and $100 with what Deluxe edition and Season Passes amounted to compared to the \"base\" version  of games at $50-$60 for some time now. \n                    2025-11-14 17:21:52\n            \n    \n    \n    \n    \n            \n\n    \n    \n        \n\n    \n\n        \n                                    \n\n\n    \n\n    \n    \n    \n\n\n    \n    \n        Upvote\n            \n                                    1\n                            \n        \n        Downvote\n    \n                                \n                \n                    Reply\n                \n            \n                                                                                                \n                                                        Copy",
  "I think people are being overly harsh about Nintendo raising prices when games pretty much have been $80 and $100 with what Deluxe edition and Season Passes amounted to compared to the \"base\" version  of games at $50-$60 for some time now.",
  "JakeWinterScones\n\n                                                        \n                \n                                                            \n                                    \n                                                    \n                                    \n                \n                    \n                    \n        \n                            \n                                                                        JakeWinterScones\n                                            \n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        \n                        \n\n\n\n\n                                        \n\n    \n\n\n\n    \n\n\n        \n            \n\n                                                            \n                                                                \n\n            \n                \n                    JakeWinterScones\n                                                                                \n                \n                    #BV329323\n\n                    \n                                                                                \n\n            \n        \n\n\n                    \n                                    Member since 2023-12-13\n                            \n        \n        \n            \n                \n                                                                    \n                                \n                                            \n\n        \n\n        \n            \n                                                                                                        \n                Following\n\n                                                \n                    0\n                    Topics\n                \n                                                                 \n                    0\n                    Users\n                \n                \n            \n        \n        \n                        \n                                                                                \n                \n                                                                                            \n                                \n            \n                        \n            \n                \n                \n                                                                        Follow\n                                                            \n            \n\n            \n                \n                \n                                                            Followed\n                                                    \n            \n        \n                                                                0  Followers \n                                    \n            \n                        View\n        \n    \n\n\n\n\n                                    \n            \n            \n                    \n        \n    \n        \n\n\n\n    \n    \n\n    \n\n\n\n    \n            \n    \n\n\n            \n\n\n\n\n            versatile-tech-user That's a fair assessment and on hindsight, I may have been a bit harsh myself. Nintendo doesn't even re-release \"deluxe editions\" until at least several years, such as in the case of Super Mario U, Donkey Kong Tropical Freeze, just to name a few... and Nintendo probably did it because the Wii U didn't do well. \n                    2025-11-16 21:58:03\n            \n    \n    \n    \n    \n            \n\n    \n    \n        \n\n    \n\n        \n                                    \n\n\n    \n\n    \n    \n    \n\n\n    \n    \n        Upvote\n            \n                            \n        \n        Downvote\n    \n                                \n                \n                    Reply\n                \n            \n                                                                                                \n                                                        Copy",
  "versatile-tech-user That's a fair assessment and on hindsight, I may have been a bit harsh myself. Nintendo doesn't even re-release \"deluxe editions\" until at least several years, such as in the case of Super Mario U, Donkey Kong Tropical Freeze, just to name a few... and Nintendo probably did it because the Wii U didn't do well.",
  "David\n\n                                                        \n                \n                                                            \n                                    \n                                                    \n                                    \n                \n                    \n                    \n        \n                            \n                                                                        David\n                                            \n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        \n                        \n\n\n\n\n                                        \n\n    \n\n\n\n    \n\n\n        \n            \n\n                                                            \n                                                                \n\n            \n                \n                    David\n                                                                                \n                \n                    #CL259702\n\n                    \n                                                                                \n\n            \n        \n\n\n                    \n                                    Member since 2025-11-15\n                            \n        \n        \n            \n                \n                                                                    \n                                \n                                            \n\n        \n\n        \n            \n                                                                                                        \n                Following\n\n                                                \n                    0\n                    Topics\n                \n                                                                 \n                    0\n                    Users\n                \n                \n            \n        \n        \n                        \n                                                                                \n                \n                                                                                            \n                                \n            \n                        \n            \n                \n                \n                                                                        Follow\n                                                            \n            \n\n            \n                \n                \n                                                            Followed\n                                                    \n            \n        \n                                                                0  Followers \n                                    \n            \n                        View\n        \n    \n\n\n\n\n                                    \n            \n            \n                    \n        \n    \n        \n\n\n\n    \n    \n\n    \n\n\n\n    \n            \n    \n\n\n            \n\n\n\n\n            Not sure why there’s so much criticism about specs. It’s got to be affordable for the masses so hardcore gamers should stick with their PCs (this product is not for you)More competition in the home console is a good thing and it’s going to be huge for the casual / retro gamer that don’t want an Xbox / ps5. \n                    2025-11-15 10:25:02\n            \n    \n    \n    \n    \n            \n\n    \n    \n        \n\n    \n\n        \n                                    \n\n\n    \n\n    \n    \n    \n\n\n    \n    \n        Upvote\n            \n                                    1\n                            \n        \n        Downvote\n    \n                                \n                \n                    Reply\n                    \n                        \n                    \n                \n            \n                                                                                                \n                                                        Copy",
  "Not sure why there’s so much criticism about specs. It’s got to be affordable for the masses so hardcore gamers should stick with their PCs (this product is not for you)",
  "More competition in the home console is a good thing and it’s going to be huge for the casual / retro gamer that don’t want an Xbox / ps5.",
  "ANDREW\n\n                                                        \n                \n                                                            \n                                    \n                                                    \n                                    \n                \n                    \n                    \n        \n                            \n                                                                        ANDREW\n                                            \n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        \n                        \n\n\n\n\n                                        \n\n    \n\n\n\n    \n\n\n        \n            \n\n                                                            \n                                                                \n\n            \n                \n                    ANDREW\n                                                                                \n                \n                    #SP407432\n\n                    \n                                                                                \n\n            \n        \n\n\n                    \n                                    Member since 2025-11-14\n                            \n        \n        \n            \n                \n                                                                    \n                                \n                                            \n\n        \n\n        \n            \n                                                                                                        \n                Following\n\n                                                \n                    0\n                    Topics\n                \n                                                                 \n                    0\n                    Users\n                \n                \n            \n        \n        \n                        \n                                                                                \n                \n                                                                                            \n                                \n            \n                        \n            \n                \n                \n                                                                        Follow\n                                                            \n            \n\n            \n                \n                \n                                                            Followed\n                                                    \n            \n        \n                                                                0  Followers \n                                    \n            \n                        View\n        \n    \n\n\n\n\n                                    \n            \n            \n                    \n        \n    \n        \n\n\n\n    \n    \n\n    \n\n\n\n    \n            \n    \n\n\n            \n\n\n\n\n            Oh no, whatever should I do!!! They cut corners. well my friend, it’s called free will, they are not forcing you to buy it. BTW - I didn’t read the article because the headline of off-putting enough. \n                    2025-11-14 13:54:07\n            \n    \n    \n    \n    \n            \n\n    \n    \n        \n\n    \n\n        \n                                    \n\n\n    \n\n    \n    \n    \n\n\n    \n    \n        Upvote\n            \n                                    1\n                            \n        \n        Downvote\n    \n                                \n                \n                    Reply\n                    \n                        1\n                    \n                \n            \n                                                                                                \n                                                        Copy",
  "Oh no, whatever should I do!!! They cut corners.",
  "well my friend, it’s called free will, they are not forcing you to buy it.",
  "BTW - I didn’t read the article because the headline of off-putting enough.",
  "Adrian\n\n                                                        \n                \n                                                            \n                                    \n                                                    \n                                    \n                \n                    \n                    \n        \n                            \n                                                                        Adrian\n                                            \n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        \n                        \n\n\n\n\n                                        \n\n    \n\n\n\n    \n\n\n        \n            \n\n                                                            \n                                                                \n\n            \n                \n                    Adrian\n                                                                                \n                \n                    #QG693341\n\n                    \n                                                                                \n\n            \n        \n\n\n                    \n                                    Member since 2025-11-16\n                            \n        \n        \n            \n                \n                                                                    \n                                \n                                            \n\n        \n\n        \n            \n                                                                                                        \n                Following\n\n                                                \n                    0\n                    Topics\n                \n                                                                 \n                    0\n                    Users\n                \n                \n            \n        \n        \n                        \n                                                                                \n                \n                                                                                            \n                                \n            \n                        \n            \n                \n                \n                                                                        Follow\n                                                            \n            \n\n            \n                \n                \n                                                            Followed\n                                                    \n            \n        \n                                                                0  Followers \n                                    \n            \n                        View\n        \n    \n\n\n\n\n                                    \n            \n            \n                    \n        \n    \n        \n\n\n\n    \n    \n\n    \n\n\n\n    \n            \n    \n\n\n            \n\n\n\n\n            Isn't ALL consumer electronics built on a price point I thought when reading the headline.My mum (God rest her soul) gave me the money to get the Ferrari of gaming systems when she was told on one horrible Xmas Eve that she had lung AND brain cancer with weeks to liveWith no upper limit I dropped 6 thousand POUNDS on my gaming rig to remember her by (OK 1200 was tax to pay for the NHS ETC)But valve have to take every screw, capacitor, connector, cable and it all adds to the cost and they have to hit their cost with as good as machine as possible You can tell the PS4 was certainly built to a price point with it's compromised IO and I was glad to swap it for the PS5Now I am not in a rush for a PS6 but I am in the market for a box under my wall mounted TV and if I can stream from the monster PC to it that would be great.I want to he in the same room as my wife at night even if we're both on our PCs then we are still together Anyways I expect that due to global factors such as tariffs and the UK budget the price may still now be sliding around the calculations, especially in the UK with the market instability that our government is generating Let's wait and see where the price settles\n                    2025-11-16 11:55:16\n            \n    \n    \n    \n    \n            \n\n    \n    \n        \n\n    \n\n        \n                                    \n\n\n    \n\n    \n    \n    \n\n\n    \n    \n        Upvote\n            \n                            \n        \n        Downvote\n    \n                                \n                \n                    Reply\n                \n            \n                                                                                                \n                                                        Copy",
  "Isn't ALL consumer electronics built on a price point I thought when reading the headline.",
  "My mum (God rest her soul) gave me the money to get the Ferrari of gaming systems when she was told on one horrible Xmas Eve that she had lung AND brain cancer with weeks to live",
  "With no upper limit I dropped 6 thousand POUNDS on my gaming rig to remember her by (OK 1200 was tax to pay for the NHS ETC)",
  "But valve have to take every screw, capacitor, connector, cable and it all adds to the cost and they have to hit their cost with as good as machine as possible",
  "You can tell the PS4 was certainly built to a price point with it's compromised IO and I was glad to swap it for the PS5",
  "Now I am not in a rush for a PS6 but I am in the market for a box under my wall mounted TV and if I can stream from the monster PC to it that would be great.",
  "I want to he in the same room as my wife at night even if we're both on our PCs then we are still together",
  "Anyways I expect that due to global factors such as tariffs and the UK budget the price may still now be sliding around the calculations, especially in the UK with the market instability that our government is generating",
  "Let's wait and see where the price settles",
  "Joshua\n\n                                                        \n                \n                                                            \n                                    \n                                                    \n                                    \n                \n                    \n                    \n        \n                            \n                                                                        Joshua\n                                            \n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        \n                        \n\n\n\n\n                                        \n\n    \n\n\n\n    \n\n\n        \n            \n\n                                                            \n                                                                \n\n            \n                \n                    Joshua\n                                                                                \n                \n                    #JN043558\n\n                    \n                                                                                \n\n            \n        \n\n\n                    \n                                    Member since 2025-11-13\n                            \n        \n        \n            \n                \n                                                                    \n                                \n                                            \n\n        \n\n        \n            \n                                                                                                        \n                Following\n\n                                                \n                    0\n                    Topics\n                \n                                                                 \n                    0\n                    Users\n                \n                \n            \n        \n        \n                        \n                                                                                \n                \n                                                                                            \n                                \n            \n                        \n            \n                \n                \n                                                                        Follow\n                                                            \n            \n\n            \n                \n                \n                                                            Followed\n                                                    \n            \n        \n                                                                0  Followers \n                                    \n            \n                        View\n        \n    \n\n\n\n\n                                    \n            \n            \n                    \n        \n    \n        \n\n\n\n    \n    \n\n    \n\n\n\n    \n            \n    \n\n\n            \n\n\n\n\n            We can tell \n                    2025-11-13 14:05:44\n            \n    \n    \n    \n    \n            \n\n    \n    \n        \n\n    \n\n        \n                                    \n\n\n    \n\n    \n    \n    \n\n\n    \n    \n        Upvote\n            \n                                    1\n                            \n        \n        Downvote\n    \n                                \n                \n                    Reply\n                    \n                        \n                    \n                \n            \n                                                                                                \n                                                        Copy",
  "We can tell",
  "Brian\n\n                                                        \n                \n                                                            \n                                    \n                                                    \n                                    \n                \n                    \n                    \n        \n                            \n                                                                        Brian\n                                            \n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        \n                        \n\n\n\n\n                                        \n\n    \n\n\n\n    \n\n\n        \n            \n\n                                                            \n                                                                \n\n            \n                \n                    Brian\n                                                                                \n                \n                    #VQ382289\n\n                    \n                                                                                \n\n            \n        \n\n\n                    \n                                    Member since 2025-11-15\n                            \n        \n        \n            \n                \n                                                                    \n                                \n                                            \n\n        \n\n        \n            \n                                                                                                        \n                Following\n\n                                                \n                    0\n                    Topics\n                \n                                                                 \n                    0\n                    Users\n                \n                \n            \n        \n        \n                        \n                                                                                \n                \n                                                                                            \n                                \n            \n                        \n            \n                \n                \n                                                                        Follow\n                                                            \n            \n\n            \n                \n                \n                                                            Followed\n                                                    \n            \n        \n                                                                0  Followers \n                                    \n            \n                        View\n        \n    \n\n\n\n\n                                    \n            \n            \n                    \n        \n    \n        \n\n\n\n    \n    \n\n    \n\n\n\n    \n            \n    \n\n\n            \n\n\n\n\n            Valve’s doing their classic move—min-maxing price and performance to hit the perfect spec. The Deck targeted 800p; the living room version is all about 4K/60. And yeah, I know there’ll be a Pro model in a year or so that’ll crush this one, but I’m still buying early because I want to support what they’re building.\n                    2025-11-15 16:00:16\n            \n    \n    \n    \n    \n            \n\n    \n    \n        \n\n    \n\n        \n                                    \n\n\n    \n\n    \n    \n    \n\n\n    \n    \n        Upvote\n            \n                                    1\n                            \n        \n        Downvote\n    \n                                \n                \n                    Reply\n                    \n                        \n                    \n                \n            \n                                                                                                \n                                                        Copy",
  "Valve’s doing their classic move—min-maxing price and performance to hit the perfect spec. The Deck targeted 800p; the living room version is all about 4K/60. And yeah, I know there’ll be a Pro model in a year or so that’ll crush this one, but I’m still buying early because I want to support what they’re building.",
  "Burnerboi\n\n                                                        \n                \n                                                            \n                                    \n                                                    \n                                    \n                \n                    \n                    \n        \n                            \n                                                                        Burnerboi\n                                            \n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        \n                        \n\n\n\n\n                                        \n\n    \n\n\n\n    \n\n\n        \n            \n\n                                                            \n                                                                \n\n            \n                \n                    Burnerboi\n                                                                                \n                \n                    #DI446864\n\n                    \n                                                                                \n\n            \n        \n\n\n                    \n                                    Member since 2025-02-06\n                            \n        \n        \n            \n                \n                                                                    \n                                \n                                            \n\n        \n\n        \n            \n                                                                                                        \n                Following\n\n                                                \n                    0\n                    Topics\n                \n                                                                 \n                    0\n                    Users\n                \n                \n            \n        \n        \n                        \n                                                                                \n                \n                                                                                            \n                                \n            \n                        \n            \n                \n                \n                                                                        Follow\n                                                            \n            \n\n            \n                \n                \n                                                            Followed\n                                                    \n            \n        \n                                                                0  Followers \n                                    \n            \n                        View\n        \n    \n\n\n\n\n                                    \n            \n            \n                    \n        \n    \n        \n\n\n\n    \n    \n\n    \n\n\n\n    \n            \n    \n\n\n            \n\n\n\n\n            In my opinion, the real value here is in the desktop steamos that's being released. When steamos for the steam deck came out, all of us knows haters were trying to get on to steamos, but it wasn't really ready for a fell. A PC debut. Baside has filled that for me, I think it's going to do even better when someone can just wipe their home. PC, throw a new graphics card in it, upgrade some RAM, and then have the same system that is on the steam box. If Linux ever gets to the point of understanding how to make things so simple that you can switch from Windows without having to learn too much more, I think Windows will truly be dead. Unfortunately, Linux is hard enough that I don't know if that's ever truly possible. But either way, far more excited for what will come of the os. Especially for the VR thing- would I be able to wipe my metaquest and put the frames operating system on it, and then? Without all of the obnoxious obstructions that Facebook had on it?\n                    2025-11-13 18:01:29\n            \n    \n    \n    \n    \n            \n\n    \n    \n        \n\n    \n\n        \n                                    \n\n\n    \n\n    \n    \n    \n\n\n    \n    \n        Upvote\n            \n                                    1\n                            \n        \n        Downvote\n    \n                                \n                \n                    Reply\n                    \n                        1\n                    \n                \n            \n                                                                                                \n                                                        Copy",
  "In my opinion, the real value here is in the desktop steamos that's being released. When steamos for the steam deck came out, all of us knows haters were trying to get on to steamos, but it wasn't really ready for a fell. A PC debut. Baside has filled that for me, I think it's going to do even better when someone can just wipe their home. PC, throw a new graphics card in it, upgrade some RAM, and then have the same system that is on the steam box. If Linux ever gets to the point of understanding how to make things so simple that you can switch from Windows without having to learn too much more, I think Windows will truly be dead. Unfortunately, Linux is hard enough that I don't know if that's ever truly possible.",
  "But either way, far more excited for what will come of the os. Especially for the VR thing- would I be able to wipe my metaquest and put the frames operating system on it, and then? Without all of the obnoxious obstructions that Facebook had on it?",
  "Adrian\n\n                                                        \n                \n                                                            \n                                    \n                                                    \n                                    \n                \n                    \n                    \n        \n                            \n                                                                        Adrian\n                                            \n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        \n                        \n\n\n\n\n                                        \n\n    \n\n\n\n    \n\n\n        \n            \n\n                                                            \n                                                                \n\n            \n                \n                    Adrian\n                                                                                \n                \n                    #QG693341\n\n                    \n                                                                                \n\n            \n        \n\n\n                    \n                                    Member since 2025-11-16\n                            \n        \n        \n            \n                \n                                                                    \n                                \n                                            \n\n        \n\n        \n            \n                                                                                                        \n                Following\n\n                                                \n                    0\n                    Topics\n                \n                                                                 \n                    0\n                    Users\n                \n                \n            \n        \n        \n                        \n                                                                                \n                \n                                                                                            \n                                \n            \n                        \n            \n                \n                \n                                                                        Follow\n                                                            \n            \n\n            \n                \n                \n                                                            Followed\n                                                    \n            \n        \n                                                                0  Followers \n                                    \n            \n                        View\n        \n    \n\n\n\n\n                                    \n            \n            \n                    \n        \n    \n        \n\n\n\n    \n    \n\n    \n\n\n\n    \n            \n    \n\n\n            \n\n\n\n\n            In Germany a whole region of local Government has spent a lot of time and money migrating away from Microsoft products and Windows to open source equivalentsThis included something like 40 thousand email boxesThis is where the change needs to happen in corporate and government  level to kick MS into touchAnd here in the UK the department of agriculture has spent 315 million upgrading to Windows 10 just in time for end of life, typical UK public spending they take too long and money getting to the previous step\n                    2025-11-16 12:10:28\n            \n    \n    \n    \n    \n            \n\n    \n    \n        \n\n    \n\n        \n                                    \n\n\n    \n\n    \n    \n    \n\n\n    \n    \n        Upvote\n            \n                            \n        \n        Downvote\n    \n                                \n                \n                    Reply\n                \n            \n                                                                                                \n                                                        Copy",
  "In Germany a whole region of local Government has spent a lot of time and money migrating away from Microsoft products and Windows to open source equivalents",
  "This included something like 40 thousand email boxes",
  "This is where the change needs to happen in corporate and government  level to kick MS into touch",
  "And here in the UK the department of agriculture has spent 315 million upgrading to Windows 10 just in time for end of life, typical UK public spending they take too long and money getting to the previous step",
  "DexCharisma\n\n                                                        \n                \n                                                            \n                                    \n                                                    \n                                    \n                \n                    \n                    \n        \n                            \n                                                                        DexCharisma\n                                            \n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        \n                        \n\n\n\n\n                                        \n\n    \n\n\n\n    \n\n\n        \n            \n\n                                                            \n                                                                \n\n            \n                \n                    DexCharisma\n                                                                                \n                \n                    #RV211364\n\n                    \n                                                                                \n\n            \n        \n\n\n                    \n                                    Member since 2025-02-10\n                            \n        \n        \n            \n                \n                                                                    \n                                \n                                            \n\n        \n\n        \n            \n                                                                                                        \n                Following\n\n                                                \n                    0\n                    Topics\n                \n                                                                 \n                    0\n                    Users\n                \n                \n            \n        \n        \n                        \n                                                                                \n                \n                                                                                            \n                                \n            \n                        \n            \n                \n                \n                                                                        Follow\n                                                            \n            \n\n            \n                \n                \n                                                            Followed\n                                                    \n            \n        \n                                                                0  Followers \n                                    \n            \n                        View\n        \n    \n\n\n\n\n                                    \n            \n            \n                    \n        \n    \n        \n\n\n\n    \n    \n\n    \n\n\n\n    \n            \n    \n\n\n            \n\n\n\n\n            Should we be applauding them for yet another underwhelming piece of hardware?This is a PC, not a Switch.\n                    2025-11-13 14:28:47\n            \n    \n    \n    \n    \n            \n\n    \n    \n        \n\n    \n\n        \n                                    \n\n\n    \n\n    \n    \n    \n\n\n    \n    \n        Upvote\n            \n                                    2\n                            \n        \n        Downvote\n    \n                                \n                \n                    Reply\n                    \n                        2\n                    \n                \n            \n                                                                                                \n                                                        Copy",
  "Should we be applauding them for yet another underwhelming piece of hardware?",
  "This is a PC, not a Switch.",
  "Diss\n\n                                                        \n                \n                                                            \n                                    \n                                                    \n                                    \n                \n                    \n                    \n        \n                            \n                                                                        Diss\n                                            \n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        \n                        \n\n\n\n\n                                        \n\n    \n\n\n\n    \n\n\n        \n            \n\n                                                            \n                                                                \n\n            \n                \n                    Diss\n                                                                                \n                \n                    #IT782541\n\n                    \n                                                                                \n\n            \n        \n\n\n                    \n                                    Member since 2025-09-10\n                            \n        \n        \n            \n                \n                                                                    \n                                \n                                            \n\n        \n\n        \n            \n                                                                                                        \n                Following\n\n                                                \n                    0\n                    Topics\n                \n                                                                 \n                    0\n                    Users\n                \n                \n            \n        \n        \n                        \n                                                                                \n                \n                                                                                            \n                                \n            \n                        \n            \n                \n                \n                                                                        Follow\n                                                            \n            \n\n            \n                \n                \n                                                            Followed\n                                                    \n            \n        \n                                                                0  Followers \n                                    \n            \n                        View\n        \n    \n\n\n\n\n                                    \n            \n            \n                    \n        \n    \n        \n\n\n\n    \n    \n\n    \n\n\n\n    \n            \n    \n\n\n            \n\n\n\n\n            Thank God it'll be able to run switch games better than the switch can then.\n                    2025-11-13 21:59:58\n            \n    \n    \n    \n    \n            \n\n    \n    \n        \n\n    \n\n        \n                                    \n\n\n    \n\n    \n    \n    \n\n\n    \n    \n        Upvote\n            \n                                    3\n                            \n        \n        Downvote\n    \n                                \n                \n                    Reply\n                \n            \n                                                                                                \n                                                        Copy",
  "Thank God it'll be able to run switch games better than the switch can then.",
  "Darian\n\n                                                        \n                \n                                                            \n                                    \n                                                    \n                                    \n                \n                    \n                    \n        \n                            \n                                                                        Darian\n                                            \n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        \n                        \n\n\n\n\n                                        \n\n    \n\n\n\n    \n\n\n        \n            \n\n                                                            \n                                                                \n\n            \n                \n                    Darian\n                                                                                \n                \n                    #PD984452\n\n                    \n                                                                                \n\n            \n        \n\n\n                    \n                                    Member since 2025-08-13\n                            \n        \n        \n            \n                \n                                                                    \n                                \n                                            \n\n        \n\n        \n            \n                                                                                                        \n                Following\n\n                                                \n                    0\n                    Topics\n                \n                                                                 \n                    0\n                    Users\n                \n                \n            \n        \n        \n                        \n                                                                                \n                \n                                                                                            \n                                \n            \n                        \n            \n                \n                \n                                                                        Follow\n                                                            \n            \n\n            \n                \n                \n                                                            Followed\n                                                    \n            \n        \n                                                                0  Followers \n                                    \n            \n                        View\n        \n    \n\n\n\n\n                                    \n            \n            \n                    \n        \n    \n        \n\n\n\n    \n    \n\n    \n\n\n\n    \n            \n    \n\n\n            \n\n\n\n\n            Diss literally anything could, lol \n                    2025-11-14 11:59:14\n            \n    \n    \n    \n    \n            \n\n    \n    \n        \n\n    \n\n        \n                                    \n\n\n    \n\n    \n    \n    \n\n\n    \n    \n        Upvote\n            \n                                    1\n                            \n        \n        Downvote\n    \n                                \n                \n                    Reply\n                \n            \n                                                                                                \n                                                        Copy",
  "Diss literally anything could, lol",
  "polygon_user_m5r9z34v\n\n                                                        \n                \n                                                            \n                                    \n                                                    \n                                    \n                \n                    \n                    \n        \n                            \n                                                                        polygon_user_m5r9z34v\n                                            \n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        \n                        \n\n\n\n\n                                        \n\n    \n\n\n\n    \n\n\n        \n            \n\n                                                            \n                                                                \n\n            \n                \n                    polygon_user_m5r9z34v\n                                                                                \n                \n                    #EM283525\n\n                    \n                                                                                \n\n            \n        \n\n\n                    \n                                    Member since 2025-01-10\n                            \n        \n        \n            \n                \n                                                                    \n                                \n                                            \n\n        \n\n        \n            \n                                                                                                        \n                Following\n\n                                                \n                    0\n                    Topics\n                \n                                                                 \n                    0\n                    Users\n                \n                \n            \n        \n        \n                        \n                                                                                \n                \n                                                                                            \n                                \n            \n                        \n            \n                \n                \n                                                                        Follow\n                                                            \n            \n\n            \n                \n                \n                                                            Followed\n                                                    \n            \n        \n                                                                0  Followers \n                                    \n            \n                        View\n        \n    \n\n\n\n\n                                    \n            \n            \n                    \n        \n    \n        \n\n\n\n    \n    \n\n    \n\n\n\n    \n            \n    \n\n\n            \n\n\n\n\n            It makes sense, the number of people who run high end rigs and don't know how to swap out GPUs is incredibly small.  That's like idiot-savant probability.  Better just serve the former and nix the later.\n                    2025-11-14 08:56:15\n            \n    \n    \n    \n    \n            \n\n    \n    \n        \n\n    \n\n        \n                                    \n\n\n    \n\n    \n    \n    \n\n\n    \n    \n        Upvote\n            \n                            \n        \n        Downvote\n    \n                                \n                \n                    Reply\n                    \n                        \n                    \n                \n            \n                                                                                                \n                                                        Copy",
  "It makes sense, the number of people who run high end rigs and don't know how to swap out GPUs is incredibly small.  That's like idiot-savant probability.  Better just serve the former and nix the later.",
  "Scott\n\n                                                        \n                \n                                                            \n                                    \n                                                    \n                                    \n                \n                    \n                    \n        \n                            \n                                                                        Scott\n                                            \n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        \n                        \n\n\n\n\n                                        \n\n    \n\n\n\n    \n\n\n        \n            \n\n                                                            \n                                                                \n\n            \n                \n                    Scott\n                                                                                \n                \n                    #HY742910\n\n                    \n                                                                                \n\n            \n        \n\n\n                    \n                                    Member since 2025-11-15\n                            \n        \n        \n            \n                \n                                                                    \n                                \n                                            \n\n        \n\n        \n            \n                                                                                                        \n                Following\n\n                                                \n                    0\n                    Topics\n                \n                                                                 \n                    0\n                    Users\n                \n                \n            \n        \n        \n                        \n                                                                                \n                \n                                                                                            \n                                \n            \n                        \n            \n                \n                \n                                                                        Follow\n                                                            \n            \n\n            \n                \n                \n                                                            Followed\n                                                    \n            \n        \n                                                                0  Followers \n                                    \n            \n                        View\n        \n    \n\n\n\n\n                                    \n            \n            \n                    \n        \n    \n        \n\n\n\n    \n    \n\n    \n\n\n\n    \n            \n    \n\n\n            \n\n\n\n\n            Most publications and commenters forget something... When gaming on a tv, many details normally seen on a 1440p or 4k monitor are lost. Because of how the pixels are drawn and distance from screen. I'm an old school PC gamer die hard who left the space as I didn't have the time to invest in the perfect PC set up, tinkering, bios, driver, OS updates. But everytime I came back to the PC I would invest thousands expecting the tip tier components would somehow make the experience better and recapture the magic back in the day with say the brand new voodoo cards or AMD processor/Intel (I know I'm dating myself here). But literally you had to pay big bucks back in the day just to play the latest and greatest. These days most games are compatible with older hardware and the most recent attempt I made at getting back into things, I opted to buy an AMD mini PC from BOSGAME that has a decent processor and an integrated 780m APU, connected to my LG C1 OLED. After installing bazzite and running Steam OS... Oh my lord. I was blown away at how great the graphics looked on a basic entry level mini integrated PC that was the size of a NUC. And we are talking about reducing the settings and resolution to sub 1080p on some games to hit 60fps. And you know what, it looked glorious on the tv. Because of how TVs resolve pixels and the distance away from the screen, the fact I can boot right into the OS and play a game within 10 seconds, and everything saving my progress if I choose to put the sucker to sleep for a bit, even after a few days or weeks. Tuning down or up settings on a per game basis and having everything save that way is amazing, having a tiny footprint of a PC is amazing, and understanding that 1080p on a decent tv can look just as good as a 4k image on a monitor. On a tv it's not so much the amount of \"pixels\" but the quality of the overall image and on most TVs at a normal distance you can't tell much of a difference between 4k and 1080p. This will be incredible\n                    2025-11-15 21:44:54\n            \n    \n    \n    \n    \n            \n\n    \n    \n        \n\n    \n\n        \n                                    \n\n\n    \n\n    \n    \n    \n\n\n    \n    \n        Upvote\n            \n                            \n        \n        Downvote\n    \n                                \n                \n                    Reply\n                    \n                        \n                    \n                \n            \n                                                                                                \n                                                        Copy",
  "Most publications and commenters forget something... When gaming on a tv, many details normally seen on a 1440p or 4k monitor are lost. Because of how the pixels are drawn and distance from screen.",
  "I'm an old school PC gamer die hard who left the space as I didn't have the time to invest in the perfect PC set up, tinkering, bios, driver, OS updates. But everytime I came back to the PC I would invest thousands expecting the tip tier components would somehow make the experience better and recapture the magic back in the day with say the brand new voodoo cards or AMD processor/Intel (I know I'm dating myself here).",
  "But literally you had to pay big bucks back in the day just to play the latest and greatest.",
  "These days most games are compatible with older hardware and the most recent attempt I made at getting back into things, I opted to buy an AMD mini PC from BOSGAME that has a decent processor and an integrated 780m APU, connected to my LG C1 OLED. After installing bazzite and running Steam OS... Oh my lord. I was blown away at how great the graphics looked on a basic entry level mini integrated PC that was the size of a NUC. And we are talking about reducing the settings and resolution to sub 1080p on some games to hit 60fps. And you know what, it looked glorious on the tv. Because of how TVs resolve pixels and the distance away from the screen, the fact I can boot right into the OS and play a game within 10 seconds, and everything saving my progress if I choose to put the sucker to sleep for a bit, even after a few days or weeks.",
  "Tuning down or up settings on a per game basis and having everything save that way is amazing, having a tiny footprint of a PC is amazing, and understanding that 1080p on a decent tv can look just as good as a 4k image on a monitor. On a tv it's not so much the amount of \"pixels\" but the quality of the overall image and on most TVs at a normal distance you can't tell much of a difference between 4k and 1080p. This will be incredible",
  "polygon_user_m60mbbir\n\n                                                        \n                \n                                                            \n                                    \n                                                    \n                                    \n                \n                    \n                    \n        \n                            \n                                                                        polygon_user_m60mbbir\n                                            \n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        \n                        \n\n\n\n\n                                        \n\n    \n\n\n\n    \n\n\n        \n            \n\n                                                            \n                                                                \n\n            \n                \n                    polygon_user_m60mbbir\n                                                                                \n                \n                    #YC398940\n\n                    \n                                                                                \n\n            \n        \n\n\n                    \n                                    Member since 2025-01-17\n                            \n        \n        \n            \n                \n                                                                    \n                                \n                                            \n\n        \n\n        \n            \n                                                                                                        \n                Following\n\n                                                \n                    0\n                    Topics\n                \n                                                                 \n                    0\n                    Users\n                \n                \n            \n        \n        \n                        \n                                                                                \n                \n                                                                                            \n                                \n            \n                        \n            \n                \n                \n                                                                        Follow\n                                                            \n            \n\n            \n                \n                \n                                                            Followed\n                                                    \n            \n        \n                                                                0  Followers \n                                    \n            \n                        View\n        \n    \n\n\n\n\n                                    \n            \n            \n                    \n        \n    \n        \n\n\n\n    \n    \n\n    \n\n\n\n    \n            \n    \n\n\n            \n\n\n\n\n            Cutting corners is a poor choice of words and implies a bias. What they are doing is keeping costs low and producing a device that is equal or better than 70% of devices currently used to play games on steam. Seems sensible and they are totally correct. That 30% upwards, especially the top end, are unlikely to want a prebuilt pc. For everyone else it's a fantastic entry into pc gaming and steam, provided those costs are low. Valve aren't stupid and have certainly learned from the past. I'll probably get one for the office and one for the front room if they are about £500-600, but we will see. It will definitely replace the console under the tv though... The big boy PC maybe not. \n                    2025-11-15 13:43:42\n            \n    \n    \n    \n    \n            \n\n    \n    \n        \n\n    \n\n        \n                                    \n\n\n    \n\n    \n    \n    \n\n\n    \n    \n        Upvote\n            \n                            \n        \n        Downvote\n    \n                                \n                \n                    Reply\n                    \n                        1\n                    \n                \n            \n                                                                                                \n                                                        Copy",
  "Cutting corners is a poor choice of words and implies a bias.",
  "What they are doing is keeping costs low and producing a device that is equal or better than 70% of devices currently used to play games on steam.",
  "Seems sensible and they are totally correct. That 30% upwards, especially the top end, are unlikely to want a prebuilt pc.",
  "For everyone else it's a fantastic entry into pc gaming and steam, provided those costs are low. Valve aren't stupid and have certainly learned from the past.",
  "I'll probably get one for the office and one for the front room if they are about £500-600, but we will see. It will definitely replace the console under the tv though... The big boy PC maybe not.",
  "Adrian\n\n                                                        \n                \n                                                            \n                                    \n                                                    \n                                    \n                \n                    \n                    \n        \n                            \n                                                                        Adrian\n                                            \n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        \n                        \n\n\n\n\n                                        \n\n    \n\n\n\n    \n\n\n        \n            \n\n                                                            \n                                                                \n\n            \n                \n                    Adrian\n                                                                                \n                \n                    #QG693341\n\n                    \n                                                                                \n\n            \n        \n\n\n                    \n                                    Member since 2025-11-16\n                            \n        \n        \n            \n                \n                                                                    \n                                \n                                            \n\n        \n\n        \n            \n                                                                                                        \n                Following\n\n                                                \n                    0\n                    Topics\n                \n                                                                 \n                    0\n                    Users\n                \n                \n            \n        \n        \n                        \n                                                                                \n                \n                                                                                            \n                                \n            \n                        \n            \n                \n                \n                                                                        Follow\n                                                            \n            \n\n            \n                \n                \n                                                            Followed\n                                                    \n            \n        \n                                                                0  Followers \n                                    \n            \n                        View\n        \n    \n\n\n\n\n                                    \n            \n            \n                    \n        \n    \n        \n\n\n\n    \n    \n\n    \n\n\n\n    \n            \n    \n\n\n            \n\n\n\n\n            In the UK there are companies who are now offering building services for those high end machinesThey have tested the parts for inter connectivity compatability and as they are considered pre built machines the warranty is the same as if it was something bought from a storeI am in the market for a prebuilt TV box and I wonder what valve will consider this as a \"success\"?\n                    2025-11-16 12:03:34\n            \n    \n    \n    \n    \n            \n\n    \n    \n        \n\n    \n\n        \n                                    \n\n\n    \n\n    \n    \n    \n\n\n    \n    \n        Upvote\n            \n                            \n        \n        Downvote\n    \n                                \n                \n                    Reply\n                \n            \n                                                                                                \n                                                        Copy",
  "In the UK there are companies who are now offering building services for those high end machines",
  "They have tested the parts for inter connectivity compatability and as they are considered pre built machines the warranty is the same as if it was something bought from a store",
  "I am in the market for a prebuilt TV box and I wonder what valve will consider this as a \"success\"?",
  "Sal\n\n                                                        \n                \n                                                            \n                                    \n                                                    \n                                    \n                \n                    \n                    \n        \n                            \n                                                                        Sal\n                                            \n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        \n                        \n\n\n\n\n                                        \n\n    \n\n\n\n    \n\n\n        \n            \n\n                                                            \n                                                                \n\n            \n                \n                    Sal\n                                                                                \n                \n                    #WV990095\n\n                    \n                                                                                \n\n            \n        \n\n\n                    \n                                    Member since 2025-11-13\n                            \n        \n        \n            \n                \n                                                                    \n                                \n                                            \n\n        \n\n        \n            \n                                                                                                        \n                Following\n\n                                                \n                    0\n                    Topics\n                \n                                                                 \n                    0\n                    Users\n                \n                \n            \n        \n        \n                        \n                                                                                \n                \n                                                                                            \n                                \n            \n                        \n            \n                \n                \n                                                                        Follow\n                                                            \n            \n\n            \n                \n                \n                                                            Followed\n                                                    \n            \n        \n                                                                0  Followers \n                                    \n            \n                        View\n        \n    \n\n\n\n\n                                    \n            \n            \n                    \n        \n    \n        \n\n\n\n    \n    \n\n    \n\n\n\n    \n            \n    \n\n\n            \n\n\n\n\n            I could just get a series S or a used PS5. This better be 500USD max if all we are getting is 8gb of vram.\n                    2025-11-13 20:41:24\n            \n    \n    \n    \n    \n            \n\n    \n    \n        \n\n    \n\n        \n                                    \n\n\n    \n\n    \n    \n    \n\n\n    \n    \n        Upvote\n            \n                                    2\n                            \n        \n        Downvote\n    \n                                \n                \n                    Reply\n                    \n                        2\n                    \n                \n            \n                                                                                                \n                                                        Copy",
  "I could just get a series S or a used PS5. This better be 500USD max if all we are getting is 8gb of vram.",
  "ReptarRampage\n\n                                                        \n                \n                                    \n                \n                                                    \n                                    \n                \n                    \n                    \n        \n                            \n                                                                        ReptarRampage\n                                            \n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        \n                        \n\n\n\n\n                                        \n\n    \n\n\n\n    \n\n\n        \n            \n\n                                    \n                                            \n\n            \n                \n                    ReptarRampage\n                                                                                \n                \n                    #EQ082769\n\n                    \n                                                                                \n\n            \n        \n\n\n                    \n                                    Member since 2025-08-11\n                            \n        \n        \n            \n                \n                                                                    \n                                \n                                            \n\n        \n\n        \n            \n                                                                                                        \n                Following\n\n                                                \n                    0\n                    Topics\n                \n                                                                 \n                    0\n                    Users\n                \n                \n            \n        \n        \n                        \n                                                                                \n                \n                                                                                            \n                                \n            \n                        \n            \n                \n                \n                                                                        Follow\n                                                            \n            \n\n            \n                \n                \n                                                            Followed\n                                                    \n            \n        \n                                                                0  Followers \n                                    \n            \n                        View\n        \n    \n\n\n\n\n                                    \n            \n            \n                    \n        \n    \n        \n\n\n\n    \n    \n\n    \n\n\n\n    \n            \n    \n\n\n            \n\n\n\n\n            You could get those things, but you'd miss out on all the games that are available. \n                    2025-11-14 08:45:14\n            \n    \n    \n    \n    \n            \n\n    \n    \n        \n\n    \n\n        \n                                    \n\n\n    \n\n    \n    \n    \n\n\n    \n    \n        Upvote\n            \n                                    2\n                            \n        \n        Downvote\n    \n                                \n                \n                    Reply\n                \n            \n                                                                                                \n                                                        Copy",
  "You could get those things, but you'd miss out on all the games that are available.",
  "Darian\n\n                                                        \n                \n                                                            \n                                    \n                                                    \n                                    \n                \n                    \n                    \n        \n                            \n                                                                        Darian\n                                            \n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        \n                        \n\n\n\n\n                                        \n\n    \n\n\n\n    \n\n\n        \n            \n\n                                                            \n                                                                \n\n            \n                \n                    Darian\n                                                                                \n                \n                    #PD984452\n\n                    \n                                                                                \n\n            \n        \n\n\n                    \n                                    Member since 2025-08-13\n                            \n        \n        \n            \n                \n                                                                    \n                                \n                                            \n\n        \n\n        \n            \n                                                                                                        \n                Following\n\n                                                \n                    0\n                    Topics\n                \n                                                                 \n                    0\n                    Users\n                \n                \n            \n        \n        \n                        \n                                                                                \n                \n                                                                                            \n                                \n            \n                        \n            \n                \n                \n                                                                        Follow\n                                                            \n            \n\n            \n                \n                \n                                                            Followed\n                                                    \n            \n        \n                                                                0  Followers \n                                    \n            \n                        View\n        \n    \n\n\n\n\n                                    \n            \n            \n                    \n        \n    \n        \n\n\n\n    \n    \n\n    \n\n\n\n    \n            \n    \n\n\n            \n\n\n\n\n            ReptarRampage but also get games not available on pc! \n                    2025-11-14 11:59:55\n            \n    \n    \n    \n    \n            \n\n    \n    \n        \n\n    \n\n        \n                                    \n\n\n    \n\n    \n    \n    \n\n\n    \n    \n        Upvote\n            \n                                    1\n                            \n        \n        Downvote\n    \n                                \n                \n                    Reply\n                \n            \n                                                                                                \n                                                        Copy",
  "ReptarRampage but also get games not available on pc!",
  "ReptarRampage\n\n                                                        \n                \n                                    \n                \n                                                    \n                                    \n                \n                    \n                    \n        \n                            \n                                                                        ReptarRampage\n                                            \n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        \n                        \n\n\n\n\n                                        \n\n    \n\n\n\n    \n\n\n        \n            \n\n                                    \n                                            \n\n            \n                \n                    ReptarRampage\n                                                                                \n                \n                    #EQ082769\n\n                    \n                                                                                \n\n            \n        \n\n\n                    \n                                    Member since 2025-08-11\n                            \n        \n        \n            \n                \n                                                                    \n                                \n                                            \n\n        \n\n        \n            \n                                                                                                        \n                Following\n\n                                                \n                    0\n                    Topics\n                \n                                                                 \n                    0\n                    Users\n                \n                \n            \n        \n        \n                        \n                                                                                \n                \n                                                                                            \n                                \n            \n                        \n            \n                \n                \n                                                                        Follow\n                                                            \n            \n\n            \n                \n                \n                                                            Followed\n                                                    \n            \n        \n                                                                0  Followers \n                                    \n            \n                        View\n        \n    \n\n\n\n\n                                    \n            \n            \n                    \n        \n    \n        \n\n\n\n    \n    \n\n    \n\n\n\n    \n            \n    \n\n\n            \n\n\n\n\n            DF kind of undersells the box. But they undersell anything not using DLSS or being a PS5. That said, SteamOS is so much better at running games than running right off of Windows, so a lot of their arm chairing number crunching is based off games would be running on Windows despite many other channels comparing the similar hardware on something like Bazzaite. VRAM is kind of low, but that processor is a lot more juicier than consoles. But I don't think VRAM is going to be a huge issue considering even with the girthy games these days, it's rare for any of them to cap out over 10GB (my Monster Hunter Wilds with the extra large textures is something like 14-16GB, and without it's like 8). So I do think the VRAM thing might be a little misconstrued, since the gpu and cpu are faster overall what's in either consoles. That plus the lightweightness of SteamOS would make it a pretty good contender hardware wise. I'm gonna assume there will be some bottlenecking, but not in the way people are talking about with it being VRAM limited. \n                    2025-11-14 08:41:29\n            \n    \n    \n    \n    \n            \n\n    \n    \n        \n\n    \n\n        \n                                    \n\n\n    \n\n    \n    \n    \n\n\n    \n    \n        Upvote\n            \n                                    2\n                            \n        \n        Downvote\n    \n                                \n                \n                    Reply\n                    \n                        2\n                    \n                \n            \n                                                                                                \n                                                        Copy",
  "DF kind of undersells the box. But they undersell anything not using DLSS or being a PS5. That said, SteamOS is so much better at running games than running right off of Windows, so a lot of their arm chairing number crunching is based off games would be running on Windows despite many other channels comparing the similar hardware on something like Bazzaite. VRAM is kind of low, but that processor is a lot more juicier than consoles. But I don't think VRAM is going to be a huge issue considering even with the girthy games these days, it's rare for any of them to cap out over 10GB (my Monster Hunter Wilds with the extra large textures is something like 14-16GB, and without it's like 8). So I do think the VRAM thing might be a little misconstrued, since the gpu and cpu are faster overall what's in either consoles. That plus the lightweightness of SteamOS would make it a pretty good contender hardware wise.",
  "I'm gonna assume there will be some bottlenecking, but not in the way people are talking about with it being VRAM limited.",
  "versatile-tech-user\n\n                                                        \n                \n                                                            \n                                    \n                                                    \n                                    \n                \n                    \n                    \n        \n                            \n                                                                        versatile-tech-user\n                                            \n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        \n                        \n\n\n\n\n                                        \n\n    \n\n\n\n    \n\n\n        \n            \n\n                                                            \n                                                                \n\n            \n                \n                    versatile-tech-user\n                                                                                \n                \n                    #DY535184\n\n                    \n                                                                                \n\n            \n        \n\n\n                    \n                                    Member since 2012-04-27\n                            \n        \n        \n            \n                \n                                                                    \n                                \n                                            \n\n        \n\n        \n            \n                                                                                                        \n                Following\n\n                                                \n                    0\n                    Topics\n                \n                                                                 \n                    0\n                    Users\n                \n                \n            \n        \n        \n                        \n                                                                                \n                \n                                                                                            \n                                \n            \n                        \n            \n                \n                \n                                                                        Follow\n                                                            \n            \n\n            \n                \n                \n                                                            Followed\n                                                    \n            \n        \n                                                                0  Followers \n                                    \n            \n                        View\n        \n    \n\n\n\n\n                                    \n            \n            \n                    \n        \n    \n        \n\n\n\n    \n    \n\n    \n\n\n\n    \n            \n    \n\n\n            \n\n\n\n\n            It's not like consoles are running Windows though: They stand to be as efficient and even more with unifiied memory and close-to-the-metal optimizations you can't match by just not using Windows. The VRAM is low, not kinda low for 4K playback which is the living room standard whether PC gamers want to scoff at that just because the PC platform handily allows them to play lower settings than the baseline quality traditional consoles run games or what the dev's ideal recommended baseline was. FSR3 and the era of ray-tracing that current-gen consoles settled with via the direct feedback of devs did not age well towards why the PS5 Pro exists in the first place. All that said, there isn't really bad specs more than bad price which makes the wait for the price to be announced REALLY interested. If it's more expensive by the PS5 Pro by like a $100 compared to being more in-between the PS5 and PS5 Pro, I can see people feeling underwhelmed by the specs. GPU/RAM/Silicon prices still are all over the place with how much they flunctuate, so it may be a very last minute  and tough decision what Valve initially announces. \n                    2025-11-14 17:36:26\n            \n    \n    \n    \n    \n            \n\n    \n    \n        \n\n    \n\n        \n                                    \n\n\n    \n\n    \n    \n    \n\n\n    \n    \n        Upvote\n            \n                            \n        \n        Downvote\n    \n                                \n                \n                    Reply\n                \n            \n                                                                                                \n                                                        Copy",
  "It's not like consoles are running Windows though: They stand to be as efficient and even more with unifiied memory and close-to-the-metal optimizations you can't match by just not using Windows.",
  "The VRAM is low, not kinda low for 4K playback which is the living room standard whether PC gamers want to scoff at that just because the PC platform handily allows them to play lower settings than the baseline quality traditional consoles run games or what the dev's ideal recommended baseline was.",
  "FSR3 and the era of ray-tracing that current-gen consoles settled with via the direct feedback of devs did not age well towards why the PS5 Pro exists in the first place.",
  "All that said, there isn't really bad specs more than bad price which makes the wait for the price to be announced REALLY interested.",
  "If it's more expensive by the PS5 Pro by like a $100 compared to being more in-between the PS5 and PS5 Pro, I can see people feeling underwhelmed by the specs.",
  "GPU/RAM/Silicon prices still are all over the place with how much they flunctuate, so it may be a very last minute  and tough decision what Valve initially announces.",
  "ReptarRampage\n\n                                                        \n                \n                                    \n                \n                                                    \n                                    \n                \n                    \n                    \n        \n                            \n                                                                        ReptarRampage\n                                            \n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        \n                        \n\n\n\n\n                                        \n\n    \n\n\n\n    \n\n\n        \n            \n\n                                    \n                                            \n\n            \n                \n                    ReptarRampage\n                                                                                \n                \n                    #EQ082769\n\n                    \n                                                                                \n\n            \n        \n\n\n                    \n                                    Member since 2025-08-11\n                            \n        \n        \n            \n                \n                                                                    \n                                \n                                            \n\n        \n\n        \n            \n                                                                                                        \n                Following\n\n                                                \n                    0\n                    Topics\n                \n                                                                 \n                    0\n                    Users\n                \n                \n            \n        \n        \n                        \n                                                                                \n                \n                                                                                            \n                                \n            \n                        \n            \n                \n                \n                                                                        Follow\n                                                            \n            \n\n            \n                \n                \n                                                            Followed\n                                                    \n            \n        \n                                                                0  Followers \n                                    \n            \n                        View\n        \n    \n\n\n\n\n                                    \n            \n            \n                    \n        \n    \n        \n\n\n\n    \n    \n\n    \n\n\n\n    \n            \n    \n\n\n            \n\n\n\n\n            versatile-tech-user we shall see about the 4k thing. Steam based the specs on this from their hardware survey which still doesn't have people running 4k at all. With this box they can stealthily look to see what kind of TV people are running in their living room. But they also already mentioned, up front I might add, that for 4k it will be upscaling, something neither console box has actively been talking about. Because the PS5 Pro can't even do 4k native. So that one's kind of a big shrug.Also weird comparison with windows because that wasn't the comment being made on them. Just that a lot of people like DF have been looking and crunching numbers for the Box itself with comparisons of the same console games running on Windows. Those comparisons shouldn't be between a PS5 version of, say Monster Hunter Wilds for example, and a copy of it on a Windows PC. Rather the differences between the Windows version being run against the Proton one. Like I mentioned towards the latter end, there's gonna be bottlenecks for sure, but I very much don't think they're going to be because the VRAM is limited as its a much faster machine. The Xbox is just as limited on VRAM, but for system features that a PS5 doesn't have and sets clear target goals for developers. \n                    2025-11-15 09:43:04\n            \n    \n    \n    \n    \n            \n\n    \n    \n        \n\n    \n\n        \n                                    \n\n\n    \n\n    \n    \n    \n\n\n    \n    \n        Upvote\n            \n                                    1\n                            \n        \n        Downvote\n    \n                                \n                \n                    Reply\n                \n            \n                                                                                                \n                                                        Copy",
  "versatile-tech-user we shall see about the 4k thing. Steam based the specs on this from their hardware survey which still doesn't have people running 4k at all. With this box they can stealthily look to see what kind of TV people are running in their living room.",
  "But they also already mentioned, up front I might add, that for 4k it will be upscaling, something neither console box has actively been talking about. Because the PS5 Pro can't even do 4k native. So that one's kind of a big shrug.",
  "Also weird comparison with windows because that wasn't the comment being made on them. Just that a lot of people like DF have been looking and crunching numbers for the Box itself with comparisons of the same console games running on Windows. Those comparisons shouldn't be between a PS5 version of, say Monster Hunter Wilds for example, and a copy of it on a Windows PC. Rather the differences between the Windows version being run against the Proton one.",
  "Like I mentioned towards the latter end, there's gonna be bottlenecks for sure, but I very much don't think they're going to be because the VRAM is limited as its a much faster machine. The Xbox is just as limited on VRAM, but for system features that a PS5 doesn't have and sets clear target goals for developers.",
  "DocVerdant\n\n                                                        \n                \n                                                            \n                                    \n                                                    \n                                    \n                \n                    \n                    \n        \n                            \n                                                                        DocVerdant\n                                            \n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        \n                        \n\n\n\n\n                                        \n\n    \n\n\n\n    \n\n\n        \n            \n\n                                                            \n                                                                \n\n            \n                \n                    DocVerdant\n                                                                                \n                \n                    #ZH435494\n\n                    \n                                                                                \n\n            \n        \n\n\n                    \n                                    Member since 2024-11-13\n                            \n        \n        \n            \n                \n                                                                    \n                                \n                                            \n\n        \n\n        \n            \n                                                                                                        \n                Following\n\n                                                \n                    0\n                    Topics\n                \n                                                                 \n                    0\n                    Users\n                \n                \n            \n        \n        \n                        \n                                                                                \n                \n                                                                                            \n                                \n            \n                        \n            \n                \n                \n                                                                        Follow\n                                                            \n            \n\n            \n                \n                \n                                                            Followed\n                                                    \n            \n        \n                                                                0  Followers \n                                    \n            \n                        View\n        \n    \n\n\n\n\n                                    \n            \n            \n                    \n        \n    \n        \n\n\n\n    \n    \n\n    \n\n\n\n    \n            \n    \n\n\n            \n\n\n\n\n            I think it should be alright, especially if the machine’s designed to be upgradable like a PC is — honestly, a modular console-PC hybrid that can be “Ship of Theseus”ed between generations is probably the ideal bridge between console and PC gamers, and as a console-exclusive gamer I’d definitely be more keen on a device like this if I know I can easily alter it later to my own specifications\n                    2025-11-13 20:09:56\n            \n    \n    \n    \n    \n            \n\n    \n    \n        \n\n    \n\n        \n                                    \n\n\n    \n\n    \n    \n    \n\n\n    \n    \n        Upvote\n            \n                                    1\n                            \n        \n        Downvote\n    \n                                \n                \n                    Reply\n                    \n                        \n                    \n                \n            \n                                                                                                \n                                                        Copy",
  "I think it should be alright, especially if the machine’s designed to be upgradable like a PC is — honestly, a modular console-PC hybrid that can be “Ship of Theseus”ed between generations is probably the ideal bridge between console and PC gamers, and as a console-exclusive gamer I’d definitely be more keen on a device like this if I know I can easily alter it later to my own specifications",
  "Smoothly Rough\n\n                                                        \n                \n                                                            \n                                    \n                                                    \n                                    \n                \n                    \n                    \n        \n                            \n                                                                        Smoothly Rough\n                                            \n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        \n                        \n\n\n\n\n                                        \n\n    \n\n\n\n    \n\n\n        \n            \n\n                                                            \n                                                                \n\n            \n                \n                    Smoothly Rough\n                                                                                \n                \n                    #UR648929\n\n                    \n                                                                                \n\n            \n        \n\n\n                    \n                                    Member since 2025-05-29\n                            \n        \n        \n            \n                \n                                                                    \n                                \n                                            \n\n        \n\n        \n            \n                                                                                                        \n                Following\n\n                                                \n                    0\n                    Topics\n                \n                                                                 \n                    0\n                    Users\n                \n                \n            \n        \n        \n                        \n                                                                                \n                \n                                                                                            \n                                \n            \n                        \n            \n                \n                \n                                                                        Follow\n                                                            \n            \n\n            \n                \n                \n                                                            Followed\n                                                    \n            \n        \n                                                                0  Followers \n                                    \n            \n                        View\n        \n    \n\n\n\n\n                                    \n            \n            \n                    \n        \n    \n        \n\n\n\n    \n    \n\n    \n\n\n\n    \n            \n    \n\n\n            \n\n\n\n\n            Why are you competing with a console generation that is about 2 years from being over? The next xbox and ps will kill this thing in performance.  Also,  you lost me at 8gb of vram. I'll wait for the PS 6\n                    2025-11-13 20:06:52\n            \n    \n    \n    \n    \n            \n\n    \n    \n        \n\n    \n\n        \n                                    \n\n\n    \n\n    \n    \n    \n\n\n    \n    \n        Upvote\n            \n                                    3\n                            \n        \n        Downvote\n    \n                                \n                \n                    Reply\n                    \n                        1\n                    \n                \n            \n                                                                                                \n                                                        Copy",
  "Why are you competing with a console generation that is about 2 years from being over? The next xbox and ps will kill this thing in performance.  Also,  you lost me at 8gb of vram. I'll wait for the PS 6",
  "yngndrw\n\n                                                        \n                \n                                                            \n                                    \n                                                    \n                                    \n                \n                    \n                    \n        \n                            \n                                                                        yngndrw\n                                            \n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        \n                        \n\n\n\n\n                                        \n\n    \n\n\n\n    \n\n\n        \n            \n\n                                                            \n                                                                \n\n            \n                \n                    yngndrw\n                                                                                \n                \n                    #GB443935\n\n                    \n                                                                                \n\n            \n        \n\n\n                    \n                                    Member since 2025-11-15\n                            \n        \n        \n            \n                \n                                                                    \n                                \n                                            \n\n        \n\n        \n            \n                                                                                                        \n                Following\n\n                                                \n                    0\n                    Topics\n                \n                                                                 \n                    0\n                    Users\n                \n                \n            \n        \n        \n                        \n                                                                                \n                \n                                                                                            \n                                \n            \n                        \n            \n                \n                \n                                                                        Follow\n                                                            \n            \n\n            \n                \n                \n                                                            Followed\n                                                    \n            \n        \n                                                                0  Followers \n                                    \n            \n                        View\n        \n    \n\n\n\n\n                                    \n            \n            \n                    \n        \n    \n        \n\n\n\n    \n    \n\n    \n\n\n\n    \n            \n    \n\n\n            \n\n\n\n\n            Nintendo seem to be doing pretty well following this model.\n                    2025-11-15 07:20:58\n            \n    \n    \n    \n    \n            \n\n    \n    \n        \n\n    \n\n        \n                                    \n\n\n    \n\n    \n    \n    \n\n\n    \n    \n        Upvote\n            \n                                    2\n                            \n        \n        Downvote\n    \n                                \n                \n                    Reply\n                \n            \n                                                                                                \n                                                        Copy",
  "Nintendo seem to be doing pretty well following this model.",
  "Jason\n\n                                                        \n                \n                                                            \n                                    \n                                                    \n                                    \n                \n                    \n                    \n        \n                            \n                                                                        Jason\n                                            \n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        \n                        \n\n\n\n\n                                        \n\n    \n\n\n\n    \n\n\n        \n            \n\n                                                            \n                                                                \n\n            \n                \n                    Jason\n                                                                                \n                \n                    #WP273059\n\n                    \n                                                                                \n\n            \n        \n\n\n                    \n                                    Member since 2025-11-13\n                            \n        \n        \n            \n                \n                                                                    \n                                \n                                            \n\n        \n\n        \n            \n                                                                                                        \n                Following\n\n                                                \n                    0\n                    Topics\n                \n                                                                 \n                    0\n                    Users\n                \n                \n            \n        \n        \n                        \n                                                                                \n                \n                                                                                            \n                                \n            \n                        \n            \n                \n                \n                                                                        Follow\n                                                            \n            \n\n            \n                \n                \n                                                            Followed\n                                                    \n            \n        \n                                                                0  Followers \n                                    \n            \n                        View\n        \n    \n\n\n\n\n                                    \n            \n            \n                    \n        \n    \n        \n\n\n\n    \n    \n\n    \n\n\n\n    \n            \n    \n\n\n            \n\n\n\n\n            So it's basically a PS4 PRO. Is that what I'm hearing. Love the look and the controllers but will have to wait to use them first. \n                    2025-11-13 20:14:45\n            \n    \n    \n    \n    \n            \n\n    \n    \n        \n\n    \n\n        \n                                    \n\n\n    \n\n    \n    \n    \n\n\n    \n    \n        Upvote\n            \n                                    1\n                            \n        \n        Downvote\n    \n                                \n                \n                    Reply\n                    \n                        \n                    \n                \n            \n                                                                                                \n                                                        Copy",
  "So it's basically a PS4 PRO. Is that what I'm hearing. Love the look and the controllers but will have to wait to use them first.",
  "Samuel\n\n                                                        \n                \n                                                            \n                                    \n                                                    \n                                    \n                \n                    \n                    \n        \n                            \n                                                                        Samuel\n                                            \n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        \n                        \n\n\n\n\n                                        \n\n    \n\n\n\n    \n\n\n        \n            \n\n                                                            \n                                                                \n\n            \n                \n                    Samuel\n                                                                                \n                \n                    #DD885164\n\n                    \n                                                                                \n\n            \n        \n\n\n                    \n                                    Member since 2025-11-13\n                            \n        \n        \n            \n                \n                                                                    \n                                \n                                            \n\n        \n\n        \n            \n                                                                                                        \n                Following\n\n                                                \n                    0\n                    Topics\n                \n                                                                 \n                    0\n                    Users\n                \n                \n            \n        \n        \n                        \n                                                                                \n                \n                                                                                            \n                                \n            \n                        \n            \n                \n                \n                                                                        Follow\n                                                            \n            \n\n            \n                \n                \n                                                            Followed\n                                                    \n            \n        \n                                                                0  Followers \n                                    \n            \n                        View\n        \n    \n\n\n\n\n                                    \n            \n            \n                    \n        \n    \n        \n\n\n\n    \n    \n\n    \n\n\n\n    \n            \n    \n\n\n            \n\n\n\n\n            All I have to say is YOGO!You only generate artificial frames once!\n                    2025-11-13 21:59:07\n            \n    \n    \n    \n    \n            \n\n    \n    \n        \n\n    \n\n        \n                                    \n\n\n    \n\n    \n    \n    \n\n\n    \n    \n        Upvote\n            \n                            \n        \n        Downvote\n    \n                                \n                \n                    Reply\n                    \n                        \n                    \n                \n            \n                                                                                                \n                                                        Copy",
  "All I have to say is YOGO!",
  "You only generate artificial frames once!",
  "Aaron\n\n                                                        \n                \n                                                            \n                                    \n                                                    \n                                    \n                \n                    \n                    \n        \n                            \n                                                                        Aaron\n                                            \n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        \n                        \n\n\n\n\n                                        \n\n    \n\n\n\n    \n\n\n        \n            \n\n                                                            \n                                                                \n\n            \n                \n                    Aaron\n                                                                                \n                \n                    #JB043899\n\n                    \n                                                                                \n\n            \n        \n\n\n                    \n                                    Member since 2025-11-14\n                            \n        \n        \n            \n                \n                                                                    \n                                \n                                            \n\n        \n\n        \n            \n                                                                                                        \n                Following\n\n                                                \n                    0\n                    Topics\n                \n                                                                 \n                    0\n                    Users\n                \n                \n            \n        \n        \n                        \n                                                                                \n                \n                                                                                            \n                                \n            \n                        \n            \n                \n                \n                                                                        Follow\n                                                            \n            \n\n            \n                \n                \n                                                            Followed\n                                                    \n            \n        \n                                                                0  Followers \n                                    \n            \n                        View\n        \n    \n\n\n\n\n                                    \n            \n            \n                    \n        \n    \n        \n\n\n\n    \n    \n\n    \n\n\n\n    \n            \n    \n\n\n            \n\n\n\n\n            We have to get away from Windows Sony and Mac.but really we don't need video games.Jimmy Carr (a crude comedian) had some words of advice for young people, go get a real career and real wife rather than video games and pr0n.Valve should sign with Solidworks and autodesk to get  the professional products supported under linux...\n                    2025-11-14 02:31:17\n            \n    \n    \n    \n    \n            \n\n    \n    \n        \n\n    \n\n        \n                                    \n\n\n    \n\n    \n    \n    \n\n\n    \n    \n        Upvote\n            \n                            \n        \n        Downvote\n    \n                                \n                \n                    Reply\n                    \n                        1\n                    \n                \n            \n                                                                                                \n                                                        Copy",
  "We have to get away from Windows Sony and Mac.",
  "but really we don't need video games.",
  "Jimmy Carr (a crude comedian) had some words of advice for young people, go get a real career and real wife rather than video games and pr0n.",
  "Valve should sign with Solidworks and autodesk to get  the professional products supported under linux...",
  "versatile-tech-user\n\n                                                        \n                \n                                                            \n                                    \n                                                    \n                                    \n                \n                    \n                    \n        \n                            \n                                                                        versatile-tech-user\n                                            \n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        \n                        \n\n\n\n\n                                        \n\n    \n\n\n\n    \n\n\n        \n            \n\n                                                            \n                                                                \n\n            \n                \n                    versatile-tech-user\n                                                                                \n                \n                    #DY535184\n\n                    \n                                                                                \n\n            \n        \n\n\n                    \n                                    Member since 2012-04-27\n                            \n        \n        \n            \n                \n                                                                    \n                                \n                                            \n\n        \n\n        \n            \n                                                                                                        \n                Following\n\n                                                \n                    0\n                    Topics\n                \n                                                                 \n                    0\n                    Users\n                \n                \n            \n        \n        \n                        \n                                                                                \n                \n                                                                                            \n                                \n            \n                        \n            \n                \n                \n                                                                        Follow\n                                                            \n            \n\n            \n                \n                \n                                                            Followed\n                                                    \n            \n        \n                                                                0  Followers \n                                    \n            \n                        View\n        \n    \n\n\n\n\n                                    \n            \n            \n                    \n        \n    \n        \n\n\n\n    \n    \n\n    \n\n\n\n    \n            \n    \n\n\n            \n\n\n\n\n            He is right. The average gamer the industry has historically preyed on spend waaaaaay too much time playing games and adult entertainment instead of building up their sklls to comfortably afford the tech they want that's increasingly by design unsustainable for them to live life that way. To comfortably afford the ideal forms of tech and live in ideal places in America, you should be working towards making hundreds of thousand each year ideally working in tech. Ideally be a software engineer if someone love games/software so much. Similarly those who are for whatever reason messing around with their freedom trying to illegally obtain things like game lost a looooot of time circumventing just being able to comfortably afford legally obtaining them. Considering how big current-gen games are, game companies aren't as concerned about such people because the greatest equalizer to such sketchy practices is the lost time getting into that stuff and the significantly slower download times being that sketchy to begin with (same thing with other media to resort to less than ideal forms of that content as well)\n                    2025-11-14 17:29:13\n            \n    \n    \n    \n    \n            \n\n    \n    \n        \n\n    \n\n        \n                                    \n\n\n    \n\n    \n    \n    \n\n\n    \n    \n        Upvote\n            \n                            \n        \n        Downvote\n    \n                                \n                \n                    Reply\n                \n            \n                                                                                                \n                                                        Copy",
  "He is right. The average gamer the industry has historically preyed on spend waaaaaay too much time playing games and adult entertainment instead of building up their sklls to comfortably afford the tech they want that's increasingly by design unsustainable for them to live life that way.",
  "To comfortably afford the ideal forms of tech and live in ideal places in America, you should be working towards making hundreds of thousand each year ideally working in tech.",
  "Ideally be a software engineer if someone love games/software so much.",
  "Similarly those who are for whatever reason messing around with their freedom trying to illegally obtain things like game lost a looooot of time circumventing just being able to comfortably afford legally obtaining them. Considering how big current-gen games are, game companies aren't as concerned about such people because the greatest equalizer to such sketchy practices is the lost time getting into that stuff and the significantly slower download times being that sketchy to begin with (same thing with other media to resort to less than ideal forms of that content as well)",
  "inteliboy\n\n                                                        \n                \n                                                            \n                                    \n                                                    \n                                    \n                \n                    \n                    \n        \n                            \n                                                                        inteliboy\n                                            \n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        \n                        \n\n\n\n\n                                        \n\n    \n\n\n\n    \n\n\n        \n            \n\n                                                            \n                                                                \n\n            \n                \n                    inteliboy\n                                                                                \n                \n                    #FO862677\n\n                    \n                                                                                \n\n            \n        \n\n\n                    \n                                    Member since 2022-05-25\n                            \n        \n        \n            \n                \n                                                                    \n                                \n                                            \n\n        \n\n        \n            \n                                                                                                        \n                Following\n\n                                                \n                    0\n                    Topics\n                \n                                                                 \n                    0\n                    Users\n                \n                \n            \n        \n        \n                        \n                                                                                \n                \n                                                                                            \n                                \n            \n                        \n            \n                \n                \n                                                                        Follow\n                                                            \n            \n\n            \n                \n                \n                                                            Followed\n                                                    \n            \n        \n                                                                0  Followers \n                                    \n            \n                        View\n        \n    \n\n\n\n\n                                    \n            \n            \n                    \n        \n    \n        \n\n\n\n    \n    \n\n    \n\n\n\n    \n            \n    \n\n\n            \n\n\n\n\n            What's with all the USB A ports? A dying port that should be dead by now. Maybe for legacy gamers with their USB A keyboards and mouse?\n                    2025-11-13 17:51:58\n            \n    \n    \n    \n    \n            \n\n    \n    \n        \n\n    \n\n        \n                                    \n\n\n    \n\n    \n    \n    \n\n\n    \n    \n        Upvote\n            \n                            \n        \n        Downvote\n    \n                                \n                \n                    Reply\n                    \n                        3\n                    \n                \n            \n                                                                                                \n                                                        Copy",
  "What's with all the USB A ports? A dying port that should be dead by now. Maybe for legacy gamers with their USB A keyboards and mouse?",
  "ReptarRampage\n\n                                                        \n                \n                                    \n                \n                                                    \n                                    \n                \n                    \n                    \n        \n                            \n                                                                        ReptarRampage\n                                            \n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        \n                        \n\n\n\n\n                                        \n\n    \n\n\n\n    \n\n\n        \n            \n\n                                    \n                                            \n\n            \n                \n                    ReptarRampage\n                                                                                \n                \n                    #EQ082769\n\n                    \n                                                                                \n\n            \n        \n\n\n                    \n                                    Member since 2025-08-11\n                            \n        \n        \n            \n                \n                                                                    \n                                \n                                            \n\n        \n\n        \n            \n                                                                                                        \n                Following\n\n                                                \n                    0\n                    Topics\n                \n                                                                 \n                    0\n                    Users\n                \n                \n            \n        \n        \n                        \n                                                                                \n                \n                                                                                            \n                                \n            \n                        \n            \n                \n                \n                                                                        Follow\n                                                            \n            \n\n            \n                \n                \n                                                            Followed\n                                                    \n            \n        \n                                                                0  Followers \n                                    \n            \n                        View\n        \n    \n\n\n\n\n                                    \n            \n            \n                    \n        \n    \n        \n\n\n\n    \n    \n\n    \n\n\n\n    \n            \n    \n\n\n            \n\n\n\n\n            I think a lot of current console controllers come with a USB A to C cable as well. I know my PS5 controller did. \n                    2025-11-14 08:43:56\n            \n    \n    \n    \n    \n            \n\n    \n    \n        \n\n    \n\n        \n                                    \n\n\n    \n\n    \n    \n    \n\n\n    \n    \n        Upvote\n            \n                                    2\n                            \n        \n        Downvote\n    \n                                \n                \n                    Reply\n                \n            \n                                                                                                \n                                                        Copy",
  "I think a lot of current console controllers come with a USB A to C cable as well. I know my PS5 controller did.",
  "Carlos\n\n                                                        \n                \n                                                            \n                                    \n                                                    \n                                    \n                \n                    \n                    \n        \n                            \n                                                                        Carlos\n                                            \n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        \n                        \n\n\n\n\n                                        \n\n    \n\n\n\n    \n\n\n        \n            \n\n                                                            \n                                                                \n\n            \n                \n                    Carlos\n                                                                                \n                \n                    #ES796210\n\n                    \n                                                                                \n\n            \n        \n\n\n                    \n                                    Member since 2025-11-05\n                            \n        \n        \n            \n                \n                                                                    \n                                \n                                            \n\n        \n\n        \n            \n                                                                                                        \n                Following\n\n                                                \n                    0\n                    Topics\n                \n                                                                 \n                    0\n                    Users\n                \n                \n            \n        \n        \n                        \n                                                                                \n                \n                                                                                            \n                                \n            \n                        \n            \n                \n                \n                                                                        Follow\n                                                            \n            \n\n            \n                \n                \n                                                            Followed\n                                                    \n            \n        \n                                                                0  Followers \n                                    \n            \n                        View\n        \n    \n\n\n\n\n                                    \n            \n            \n                    \n        \n    \n        \n\n\n\n    \n    \n\n    \n\n\n\n    \n            \n    \n\n\n            \n\n\n\n\n            USB-A will be around forever. It's far more reliable than any other USB and 90% PC of devices used are still USB-A. In my 35 years of PC building. I have seen all types fail. USB-A is by far the least with Micro-USB being the most failed. Even USB-C slots break more than USB-A. Larger size  = more physical strength. You cant change physics.\n                    2025-11-16 09:37:17\n            \n    \n    \n    \n    \n            \n\n    \n    \n        \n\n    \n\n        \n                                    \n\n\n    \n\n    \n    \n    \n\n\n    \n    \n        Upvote\n            \n                            \n        \n        Downvote\n    \n                                \n                \n                    Reply\n                \n            \n                                                                                                \n                                                        Copy",
  "USB-A will be around forever. It's far more reliable than any other USB and 90% PC of devices used are still USB-A. In my 35 years of PC building. I have seen all types fail. USB-A is by far the least with Micro-USB being the most failed. Even USB-C slots break more than USB-A. Larger size  = more physical strength. You cant change physics.",
  "Jearil\n\n                                                        \n                \n                                                            \n                                    \n                                                    \n                                    \n                \n                    \n                    \n        \n                            \n                                                                        Jearil\n                                            \n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        \n                        \n\n\n\n\n                                        \n\n    \n\n\n\n    \n\n\n        \n            \n\n                                                            \n                                                                \n\n            \n                \n                    Jearil\n                                                                                \n                \n                    #YK899483\n\n                    \n                                                                                \n\n            \n        \n\n\n                    \n                                    Member since 2021-11-29\n                            \n        \n        \n            \n                \n                                                                    \n                                \n                                            \n\n        \n\n        \n            \n                                                                                                        \n                Following\n\n                                                \n                    0\n                    Topics\n                \n                                                                 \n                    0\n                    Users\n                \n                \n            \n        \n        \n                        \n                                                                                \n                \n                                                                                            \n                                \n            \n                        \n            \n                \n                \n                                                                        Follow\n                                                            \n            \n\n            \n                \n                \n                                                            Followed\n                                                    \n            \n        \n                                                                0  Followers \n                                    \n            \n                        View\n        \n    \n\n\n\n\n                                    \n            \n            \n                    \n        \n    \n        \n\n\n\n    \n    \n\n    \n\n\n\n    \n            \n    \n\n\n            \n\n\n\n\n            Dongles I imagine. A lot of wireless mice, keyboards, and controllers (8bitdo) that aren't Bluetooth use USB A dongles.\n                    2025-11-16 12:35:50\n            \n    \n    \n    \n    \n            \n\n    \n    \n        \n\n    \n\n        \n                                    \n\n\n    \n\n    \n    \n    \n\n\n    \n    \n        Upvote\n            \n                            \n        \n        Downvote\n    \n                                \n                \n                    Reply\n                \n            \n                                                                                                \n                                                        Copy",
  "Dongles I imagine.",
  "A lot of wireless mice, keyboards, and controllers (8bitdo) that aren't Bluetooth use USB A dongles.",
  "Terms",
  "Privacy",
  "Feedback",
  "We have a conspiracy theory about the GTA 6 delay",
  "Godzilla fans can get an early look at the monster's first TTRPG",
  "Can Kingdom Come: Deliverance 2 break into the GOTY fight?",
  "Exclusive: Watch a magical clip from a new animated movie already in theaters",
  "Most Popular",
  "Most Popular",
  "Join Our Team",
  "About Us",
  "Editorial Ethics and Guidelines",
  "Community Guidelines",
  "Media Coverage",
  "Contact Us",
  "Follow Us",
  "Advertising",
  "Careers",
  "Terms",
  "Privacy",
  "Policies"
]